{
  "year": 2008,
  "totalBills": 193,
  "bills": [
    {
      "billNumber": "SF 2054",
      "billTitle": "A bill for an act providing for county eligibility for state payment of certain mental health, mental retardation, and developmental disabilities services funding and providing effective and retroactive applicability dates.  (FormerlySF 2029.) Effective 2-4-08.",
      "dateSigned": "2008-02-04"
    },
    {
      "billNumber": "HF 2140",
      "billTitle": "A bill for an act providing for the establishment of the state percent of growth for purposes of the state school foundation program, and providing an applicability date. (FormerlyHSB 563) Effective 7-01-08.",
      "dateSigned": "2008-02-12"
    },
    {
      "billNumber": "HF 2065",
      "billTitle": "A bill for an act relating to military leaves of absence and reemployment and providing an effective date. (FormerlyHF 2001) Effective 2-14-08.",
      "dateSigned": "2008-02-14"
    },
    {
      "billNumber": "SF 572",
      "billTitle": "A bill for an act extending state tax benefits for use of soy-based transformer fluid by electric utilities and including effective and applicability date provisions.  (FormerlySF 295.)  Effective 2-20-08.",
      "dateSigned": "2008-02-20"
    },
    {
      "billNumber": "SF 2059",
      "billTitle": "A bill for an act relating to the administration of the department of cultural affairs.  (FormerlySSB 3030.)  Effective 7-1-08.",
      "dateSigned": "2008-02-28"
    },
    {
      "billNumber": "HF 2233",
      "billTitle": "A bill for an act relating to providing sales, use, and property tax exemptions for certain web search portal businesses. (FormerlyHSB 646) Effective 7-01-08.",
      "dateSigned": "2008-02-28"
    },
    {
      "billNumber": "SF 2101",
      "billTitle": "A bill for an act transferring administration of the entrepreneurs with disabilities program to the department of education.  (FormerlySSB 3070.) Effective 7-1-08.",
      "dateSigned": "2008-03-05"
    },
    {
      "billNumber": "HF 2137",
      "billTitle": "A bill for an act relating to the membership requirements and oversight responsibilities of the board of educational examiners.  (FormerlyHSB 528) Effective 7-01-08.",
      "dateSigned": "2008-03-05"
    },
    {
      "billNumber": "HF 2151",
      "billTitle": "A bill for an act relating to the advanced practice registered nurse licensure compact and providing an effective date. (FormerlyHSB 515) Effective 3-05-08.",
      "dateSigned": "2008-03-05"
    },
    {
      "billNumber": "HF 2167",
      "billTitle": "A bill for an act relating to controlled substance schedules and the reporting requirements to the board of pharmacy and making penalties applicable. (FormerlyHSB 517) Effective 7-01-08.",
      "dateSigned": "2008-03-05"
    },
    {
      "billNumber": "SF 2123",
      "billTitle": "A bill for an act updating the Code references to the Internal Revenue Code and including effective date and retroactive applicability date provisions. (FormerlySSB 3059.)  Effective 3-11-08.",
      "dateSigned": "2008-03-11"
    },
    {
      "billNumber": "HF 2359",
      "billTitle": "A bill for an act concerning veterans, including expenditures from the veterans trust fund and authorization of lottery games for veterans. (FormerlyHF 2158) Effective 7-01-08.",
      "dateSigned": "2008-03-11"
    },
    {
      "billNumber": "HF 2366",
      "billTitle": "A bill for an act designating peace officer communication equipment and other emergency services communication equipment as an essential county purpose and as an essential corporate purpose that authorizes the issuance of general obligation bonds and providing an effective date. (FormerlyHSB 587) Effective 3-13-08.",
      "dateSigned": "2008-03-13"
    },
    {
      "billNumber": "SF 249",
      "billTitle": "A bill for an act relating to the conference of eligibility on and conditions of eligibility for individuals for certain programs under the purview of the department of human services.  (FormerlySSB 1107.) Effective 7-1-08.",
      "dateSigned": "2008-03-25"
    },
    {
      "billNumber": "HF 2165",
      "billTitle": "A bill for an act relating to business corporations, by providing for distributions and business opportunities. (FormerlyHSB 544) Effective 7-01-08.",
      "dateSigned": "2008-03-25"
    },
    {
      "billNumber": "HF 2166",
      "billTitle": "A bill for an act relating to the practice of pharmacy, including provisions governing tech-check-tech programs and specifying applicable penalty provisions. (FormerlyHSB 518) Effective 7-01-08.",
      "dateSigned": "2008-03-25"
    },
    {
      "billNumber": "HF 2194",
      "billTitle": "A bill for an act relating to exemptions to state minimum wage requirements. (FormerlyHF 2002) Effective 7-01-08.",
      "dateSigned": "2008-03-25"
    },
    {
      "billNumber": "HF 2213",
      "billTitle": "A bill for an act relating to technical matters concerning the regulation of motor vehicles by the department of transportation and providing an effective date. (FormerlyHSB 514) Effective 7-01-08, with exception of sections 23-26 and section 29 effective 3-25-08.",
      "dateSigned": "2008-03-25"
    },
    {
      "billNumber": "HF 2309",
      "billTitle": "A bill for an act relating to child support recovery including assignment of support to the state relative to receipt of family investment program benefits, the reporting of delinquent child support obligors to consumer reporting agencies, access to cellular telephone numbers for the purpose of the computer match program by the child support recovery unit, the information included in a notice regarding the administrative levy of an account, and medical support of a child, and providing effective and retroactive applicability dates. Effective 3-25-08, with exception of division I effective 10-01-09.",
      "dateSigned": "2008-03-25"
    },
    {
      "billNumber": "SF 2111",
      "billTitle": "A bill for an act relating to requirements for blood lead testing and dental screening of children.  (FormerlySSB 3009.)  Effective 7-1-08.",
      "dateSigned": "2008-03-26"
    },
    {
      "billNumber": "SF 2156",
      "billTitle": "A bill for an act relating to regulation of commercial motor vehicle operators by the state department of transportation and providing penalties. (FormerlySSB 3088.)  Effective 7-1-08.",
      "dateSigned": "2008-03-26"
    },
    {
      "billNumber": "SF 2221",
      "billTitle": "A bill for an act relating to workers' compensation benefit payments for burial expenses.  (FormerlySSB 3049.)  Effective 7-1-08.",
      "dateSigned": "2008-03-26"
    },
    {
      "billNumber": "SF 2304",
      "billTitle": "A bill for an act relating to the boiler and pressure vessel safety and elevator safety revolving funds under the control of the labor commissioner. (FormerlySSB 3048.)  Effective 7-1-08.",
      "dateSigned": "2008-03-26"
    },
    {
      "billNumber": "HF 2215",
      "billTitle": "A bill for an act relating to private activity bond allocation procedures and single-project limitations. (FormerlyHSB 539) Effective 7-01-08.",
      "dateSigned": "2008-03-26"
    },
    {
      "billNumber": "HF 2268",
      "billTitle": "A bill for an act making specified revisions to the consumer credit code to conform to federal statutory updates and prohibit the transfer of ownership of a motor vehicle pursuant to a consumer rental purchase agreement. (FormerlyHSB 550) Effective 7-01-08.",
      "dateSigned": "2008-03-26"
    },
    {
      "billNumber": "HF 2287",
      "billTitle": "A bill for an act increasing the penalties that may be imposed by courts-martial under the Iowa code of military justice. (FormerlyHSB 572) Effective 7-01-08.",
      "dateSigned": "2008-03-26"
    },
    {
      "billNumber": "HF 2417",
      "billTitle": "A bill for an act exempting certain federal tax rebates under the state individual income tax and including a retroactive applicability date provision. (FormerlyHF 2342) Effective 7-01-08.",
      "dateSigned": "2008-03-26"
    },
    {
      "billNumber": "SF 2292",
      "billTitle": "A bill for an act expanding the time period during which a complaint may be filed with the Iowa civil rights commission.  (FormerlySSB 3028.) Effective 7-1-08.",
      "dateSigned": "2008-03-27"
    },
    {
      "billNumber": "SF 2347",
      "billTitle": "A bill for an act relating to the use of optical scan voting systems in every county, making an appropriation for the cost of purchasing and distributing optical scan voting systems, reducing certain appropriations, providing for continuing education for certain election personnel, and providing an effective date.  (FormerlySSB 3262.)  Effective 4-1-08.",
      "dateSigned": "2008-04-01"
    },
    {
      "billNumber": "SF 2154",
      "billTitle": "A bill for an act relating to inclined or vertical wheelchair lifts regulated by the elevator safety board.  (FormerlySSB 3043.) Effective 7-1-08.",
      "dateSigned": "2008-04-02"
    },
    {
      "billNumber": "SF 2199",
      "billTitle": "A bill for an act relating to appeals of denials of insurance coverage based on medical necessity.  (FormerlySSB 3002.) Effective 7-1-08.",
      "dateSigned": "2008-04-02"
    },
    {
      "billNumber": "SF 2317",
      "billTitle": "A bill for an act relating to statutory corrections which may adjust language to reflect current practices, insert earlier omissions, delete redundancies and inaccuracies, delete temporary language, resolve inconsistencies and conflicts, update ongoing provisions, or remove ambiguities, and including effective and retroactive applicability date provisions.  (FormerlySSB 3215.) Various effective dates; see section 116 of bill.",
      "dateSigned": "2008-04-02"
    },
    {
      "billNumber": "SF 2320",
      "billTitle": "A bill for an act relating to nonsubstantive Code corrections and including effective and retroactive applicability date provisions.  (FormerlySSB 3241.)  Various effective dates; see section 202 of bill.",
      "dateSigned": "2008-04-02"
    },
    {
      "billNumber": "SF 261",
      "billTitle": "A bill for an act requiring certain private sewage disposal system-related inspections to be conducted when certain property is sold or transferred and including an effective date provision.  (FormerlySSB 1066.)  Effective 7-1-09.",
      "dateSigned": "2008-04-03"
    },
    {
      "billNumber": "HF 2400",
      "billTitle": "A bill for an act relating to water quality by establishing a water resources coordinating council, authorizing a marketing campaign, directing assistance to local communities for monitoring and measurement, providing for a wastewater and storm water infrastructure assessment, and creating a regional assessment program and a community-based improvement program. (FormerlyHSB 615) Effective 7-01-08.",
      "dateSigned": "2008-04-03"
    },
    {
      "billNumber": "SF 2198",
      "billTitle": "A bill for an act relating to the appointment of the membership of the Brushy creek recreation area trails advisory board.  (FormerlySF 2151.) Effective 7-1-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "SF 2230",
      "billTitle": "A bill for an act authorizing the issuance of special nonresident turkey and deer hunting licenses to certain persons who have severe physical disabilities or a terminal illness.  (FormerlySF 2086.) Effective 7-1-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "SF 2328",
      "billTitle": "A bill for an act relating to the deer depredation management program, establishing a deer study advisory committee, and providing an effective date.  (FormerlySSB 3176.)  Effective 4-8-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2119",
      "billTitle": "A bill for an act relating to taking the fingerprints of a child by a governmental unit. (FormerlyHF 663) Effective 7-01-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2195",
      "billTitle": "A bill for an act relating to certain county distress criteria under the enterprise zone program. (FormerlyHF 2035) Effective 7-01-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2196",
      "billTitle": "A bill for an act requiring the department of transportation to study the acceptance of electronic payments at its customer service sites and sites operated by county treasurers. Effective 7-01-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2364",
      "billTitle": "A bill for an act relating to school district financing arrangements, specifying funds into which loan proceeds shall be deposited and from which principal and interest payments shall be expended, and authorizing utilization of physical plant and equipment levy revenue to guarantee school district energy savings contracts. (FormerlyHF 2183) Effective 7-01-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2407",
      "billTitle": "A bill for an act relating to the annual registration fee for certain motor vehicles equipped for persons with disabilities or used by persons with wheelchairs. (FormerlyHF 2110) Effective 7-01-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2423",
      "billTitle": "A bill for an act relating to the risk pool for county mental health, mental retardation, and developmental disabilities services by revising procedural and qualifying requirements. (FormerlyHF 2260) Effective 7-01-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2452",
      "billTitle": "A bill for an act relating to vehicle titles and registration plates for specialty vehicles, and providing a penalty and an effective date. (FormerlyHF 2078) Effective 7-01-09.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2551",
      "billTitle": "A bill for an act providing requirements for a nonresident of this state engaged in the aerial application of pesticides, making penalties applicable, and providing an effective date. (FormerlyHSB 702) Effective 4-08-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2553",
      "billTitle": "A bill for an act relating to per diem compensation for directors of the Iowa soybean association board. (FormerlyHSB 716) Effective 7-01-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2554",
      "billTitle": "A bill for an act providing monetary thresholds for actions by governing boards of drainage districts. (FormerlyHSB 724) Effective 7-01-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2609",
      "billTitle": "A bill for an act relating to the public release of information relating to elder group homes, assisted living facilities, and adult day services programs and providing for an effective date.  (FormerlyHSB 711) Effective 4-08-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2626",
      "billTitle": "A bill for an act relating to the appointment or election of state judicial nominating commission members. (FormerlyHSB 776) Effective 7-01-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "HF 2642",
      "billTitle": "A bill for an act relating to issuance of a treasurer's deed after expiration of the period of redemption and including an effective and applicability date provision. (FormerlyHSB 768) Effective 4-08-08.",
      "dateSigned": "2008-04-08"
    },
    {
      "billNumber": "SF 473",
      "billTitle": "A bill for an act allowing a competent adult to execute a written instrument designating a person to have sole responsibility and discretion concerning the final disposition of that adult's remains, including coordinating provisions, and providing applicability dates.  (FormerlySSB 1217.) Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 505",
      "billTitle": "A bill for an act relating to civil liability for damages relating to the use of an automated external defibrillator in sudden cardiac arrest emergencies.  (FormerlySSB 1318.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2089",
      "billTitle": "A bill for an act relating to applications for absentee ballots.  (FormerlySSB 3086.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2108",
      "billTitle": "A bill for an act relating to the designation of a Gift to Iowa's Future Recognition Day.  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2117",
      "billTitle": "A bill for an act relating to coverage of closing protection letters in real estate transactions and providing an effective date.  (FormerlySSB 3036.) Effective 4-11-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2157",
      "billTitle": "A bill for an act relating to amusement ride safety inspection fees and special inspectors authorized by the division of labor services in the department of workforce development and providing an effective date. (FormerlySSB 3046.)  Various effective dates; see section 3 of bill.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2176",
      "billTitle": "A bill for an act relating to cultural affairs by providing for the preservation of electronic records, establishing local cultural committees, and creating a civil war sesquicentennial advisory committee.  (FormerlySSB 3067).  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2177",
      "billTitle": "A bill for an act relating to health-related activities and regulation by the department of public health.  (FormerlySSB 3137.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2179",
      "billTitle": "A bill for an act making specified changes relating to professional licensing and regulation under the purview of the banking division of the department of commerce.  (FormerlySSB 3105.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2214",
      "billTitle": "A bill for an act relating to modification of a custody or physical care order or decree during the time a parent is serving active duty.  (FormerlySF 2072.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2217",
      "billTitle": "A bill for an act relating to providing legal representation to an eligible indigent person and the appointment of a guardian ad litem.  (FormerlySSB 3076.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2248",
      "billTitle": "A bill for an act modifying provisions relating to the application for a certificate of franchise authority applicable to the provision of cable or video services by an existing provider.  (FormerlySSB 3197.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2277",
      "billTitle": "A bill for an act relating to offenses against identity by establishing a procedure to secure credit information and providing a penalty.  (FormerlySSB 3213.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2289",
      "billTitle": "A bill for an act concerning state educational assistance to children of deceased veterans and the war orphans educational assistance fund, and including an effective date and retroactive applicability provision. (FormerlySSB 3032.)  Effective 4-11-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2301",
      "billTitle": "A bill for an act making revisions and modifications to uniform finance procedures for bonds issued by the state.  (FormerlySSB 3227.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2316",
      "billTitle": "A bill for an act creating the Iowa uniform prudent management of institutional funds Act and including an applicability provision.  (FormerlySSB 3232.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2333",
      "billTitle": "A bill for an act relating to the regulation of veterans commemorative property.  (FormerlySSB 3035.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2335",
      "billTitle": "A bill for an act relating to the rights of a victim of an alleged sexual assault and notification of these rights by a peace officer.  (FormerlySSB 3272.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "SF 2380",
      "billTitle": "A bill for an act establishing a low head dam public hazard program. (FormerlySF 2232.)  Effective 7-1-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 247",
      "billTitle": "A bill for an act providing voting member representation on joint E911 service boards for cities or townships providing fire protection services through a volunteer fire department.  Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2164",
      "billTitle": "A bill for an act relating to voluntary diversity or court-ordered school desegregation plans under the state's open enrollment law.  (FormerlyHSB 530) Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2328",
      "billTitle": "A bill for an act relating to services associated with the family investment program by moving the family development and self-sufficiency council and grant program to the department of human rights and revising confidentiality provisions involving the programs. (FormerlyHSB 638) Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2372",
      "billTitle": "A bill for an act limiting the scope of the electronic benefits transfer program maintained by the department of human services.  (FormerlyHSB 676) Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2383",
      "billTitle": "A bill for an act making nonsubstantive corrections to certain provisions relating to insurance and making repeals. (FormerlyHSB 595) Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2385",
      "billTitle": "A bill for an act relating to allowable investments by the treasurer of state and other authorized state agencies. (FormerlyHSB 542) Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2410",
      "billTitle": "A bill for an act relating to alarm system installer or contractor certification and electrician licensure provisions, and providing an effective date. (FormerlyHSB 640) Effective 7-01-08, with exception of sections 1 and 2 effective 4-11-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2411",
      "billTitle": "A bill for an act providing for changes in electrician licensure requirements for specified licensure classifications, and providing an effective date. (FormerlyHSB 510) Effective 4-11-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2564",
      "billTitle": "A bill for an act concerning the disaster aid individual assistance grant program. (FormerlyHSB 659) Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2568",
      "billTitle": "A bill for an act relating to the calculation of certain weekly workers' compensation benefits by requiring certain weekly workers' compensation benefits to be calculated by including an employee's shift differential pay and by changing the basis for calculating the weekly rate for certain injured inmates. (FormerlyHSB 672) Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2580",
      "billTitle": "A bill for an act providing for a sustainable natural resource funding advisory committee. (FormerlyHSB 738) Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2581",
      "billTitle": "A bill for an act relating to the donation of food to the department of natural resources or county conservation boards.  (FormerlyHSB 741) Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2603",
      "billTitle": "A bill for an act authorizing certain advanced registered nurse practitioners and psychiatrists to file certain periodic court reports on chronic substance abusers and persons with mental illness who do not require full-time placement in a treatment facility. (FormerlyHSB 588) Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2606",
      "billTitle": "A bill for an act relating to the regulation of transactions involving grain, by providing for the regulation of grain dealers and warehouse operators, and providing for the administration of the grain indemnity fund. (FormerlyHSB 699) Effective 7-01-08.",
      "dateSigned": "2008-04-11"
    },
    {
      "billNumber": "HF 2212",
      "billTitle": "A bill for an act creating a smokefree air Act and providing penalties. (FormerlyHSB 537) Effective 7-01-08.",
      "dateSigned": "2008-04-15"
    },
    {
      "billNumber": "SF 2036",
      "billTitle": "A bill for an act relating to the division of criminal and juvenile justice planning of the department of human rights by making changes to the membership of the council, permitting access to the records of the department of workforce development, and modifying the sex offender treatment and supervision task force.  (FormerlySSB 3019.)  Effective 7-1-08.",
      "dateSigned": "2008-04-16"
    },
    {
      "billNumber": "SF 2129",
      "billTitle": "A bill for an act relating to the duties of the commission on the status of Iowans of Asian and Pacific Islander heritage regarding interpreter qualifications.  (FormerlySF 2016.)  Effective 7-1-08.",
      "dateSigned": "2008-04-16"
    },
    {
      "billNumber": "SF 2281",
      "billTitle": "A bill for an act prohibiting employment discrimination against an employee witness in certain civil proceedings.  (FormerlySF 2103.) Effective 7-1-08.",
      "dateSigned": "2008-04-16"
    },
    {
      "billNumber": "SF 2338",
      "billTitle": "A bill for an act relating to the regulation of health-related professions. (FormerlySSB 3182.)  Effective 7-1-08.",
      "dateSigned": "2008-04-16"
    },
    {
      "billNumber": "HF 2390",
      "billTitle": "A bill for an act relating to the licensing and regulation of plumbers and mechanical professionals and providing effective dates. (FormerlyHF 2139) Effective 4-16-08, with exceptions of sections 5-27 and 30-34 effective 7-01-08, and sections 28 and 29 effective 1-01-09.",
      "dateSigned": "2008-04-16"
    },
    {
      "billNumber": "HF 2392",
      "billTitle": "A bill for an act relating to certain city utilities or city enterprises by making changes to procedures for notice and collection of delinquent charges and by making changes to billing notifications for water service provided to certain residential rental property. (FormerlyHF 2133) Effective 7-01-08.",
      "dateSigned": "2008-04-16"
    },
    {
      "billNumber": "HF 2542",
      "billTitle": "A bill for an act concerning work-related injuries suffered and claims made outside of this state. (FormerlyHSB 653) Effective 7-01-08.",
      "dateSigned": "2008-04-16"
    },
    {
      "billNumber": "HF 2547",
      "billTitle": "A bill for an act modifying provisions relating to statewide licensure and certification of electricians and alarm system contractors and installers, and providing an effective date.  (FormerlyHSB 593) Effective 4-16-08.",
      "dateSigned": "2008-04-16"
    },
    {
      "billNumber": "HF 2591",
      "billTitle": "A bill for an act relating to dependent adult abuse in certain facilities and programs and providing penalties. (FormerlyHSB 729) Effective 7-01-08.",
      "dateSigned": "2008-04-16"
    },
    {
      "billNumber": "HF 2646",
      "billTitle": "A bill for an act providing for the licensure of persons installing fire protection systems, providing for the establishment of fees, and providing penalties and an effective date. (FormerlyHSB 613) Effective 8-01-09.",
      "dateSigned": "2008-04-16"
    },
    {
      "billNumber": "HF 2393",
      "billTitle": "A bill for an act providing requirements for minority impact statements in relation to state grant applications and correctional impact statements for legislation, and providing effection and applicability dates. (FormerlyHSB 589) Effective 7-01-08.",
      "dateSigned": "2008-04-17"
    },
    {
      "billNumber": "SF 2133",
      "billTitle": "A bill for an act relating to the Iowa crop improvement association. (FormerlySSB 3041.)  Effective 7-1-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "SF 2136",
      "billTitle": "A bill for an act relating to real estate broker trust accounts and abolishing the local housing assistance program.  (FormerlySSB 3064.) Effective 7-1-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "SF 2212",
      "billTitle": "A bill for an act relating to determinations in child in need of assistance proceedings, and modifying circumstances for termination of parental rights. (FormerlySSB 3122.)  Effective 7-1-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "SF 2250",
      "billTitle": "A bill for an act relating to the licensure of real estate brokers and salespersons.  (FormerlySSB 3172.)  Effective 7-1-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "SF 2251",
      "billTitle": "A bill for an act relating to student eye care and including an applicability date provision.  (FormerlySSB 3098.)  Effective 7-1-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "SF 2307",
      "billTitle": "A bill for an act establishing committees to formulate plans for a state research and development prekindergarten through grade twelve school and providing an effective date.  (FormerlySF 2236.) Effective 4-18-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "SF 2325",
      "billTitle": "A bill for an act relating to the grow Iowa values fund by allocating moneys for the physical infrastructure assistance program and changing certain job and wage requirements, and providing an effective date.  (FormerlySSB 3199.)  Effective 4-18-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "SF 2349",
      "billTitle": "A bill for an act relating to the preneed sale of cemetery and funeral merchandise and funeral services.  (FormerlySF 2233.) Effective 7-1-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "SF 2361",
      "billTitle": "A bill for an act providing for the procurement of designated biobased products by state government.  (FormerlySF 2272.) Effective 7-1-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "SF 2367",
      "billTitle": "A bill for an act relating to the compliance advisory panel, including the appointment of its members and its powers and duties.  (FormerlySSB 3178.) Effective 7-1-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "SF 2379",
      "billTitle": "A bill for an act relating to the regulation of the practice of certified public accounting and providing an effective date.  (FormerlySSB 3117.) Effective 7-1-09.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "HF 2103",
      "billTitle": "A bill for an act relating to appointments to the college student aid commission and including an effective date and applicability provision. (FormerlyHSB 503) Effective 4-18-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "HF 2145",
      "billTitle": "A bill for an act to require insurers offering certain individual or group health insurance contracts, policies, or plans to provide coverage for vaccinations for human papilloma virus. (FormerlyHSB 566) Effective 7-01-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "HF 2570",
      "billTitle": "A bill for an act relating to solid waste disposal and environmental management by providing for the designation of environmental management systems, providing incentives, and creating a solid waste alternatives program advisory council, and modifying fees and allocations of funds. (FormerlyHSB 652) Effective 7-01-08.",
      "dateSigned": "2008-04-18"
    },
    {
      "billNumber": "SF 2246",
      "billTitle": "A bill for an act relating to required disclosures in real estate transactions.  (FormerlySSB 3170.)  Effective 7-1-08.",
      "dateSigned": "2008-04-22"
    },
    {
      "billNumber": "SF 2269",
      "billTitle": "A bill for an act revising family investment program requirements for limited benefit plans.  (FormerlySSB 3135.)  Effective 7-1-08.",
      "dateSigned": "2008-04-22"
    },
    {
      "billNumber": "SF 2286",
      "billTitle": "A bill for an act appropriating federal funds made available from federal block grants and other federal grants, allocating portions of federal block grants, and providing procedures if federal funds are more or less than anticipated or if federal block grants are more or less than anticipated. (FormerlySSB 3100.)  Effective 7-1-08.",
      "dateSigned": "2008-04-22"
    },
    {
      "billNumber": "SF 2340",
      "billTitle": "A bill for an act requiring certain identity documents to be provided to children subject to a court order for out-of-home placement.  (FormerlySF 2285.)  Effective 7-1-08.",
      "dateSigned": "2008-04-22"
    },
    {
      "billNumber": "SF 2420",
      "billTitle": "A bill for an act relating to and increasing motor vehicle and trailer registration fees and title fees, allocating new revenues from fees to the TIME-21 fund, requiring the department of transportation to conduct an analysis of TIME-21 funding and a study of public transit funding, increasing the motorcycle operator's license fee and allocating the increased revenue to the motorcycle rider education fund, reallocating certain fees collected by the department of transportation, repealing the use tax on vehicles subject to registration and the use tax on certain leased motor vehicles, establishing a fee for new registration of vehicles, providing penalties, and providing effective and applicability dates. (FormerlySSB 3267&SF 2389.)  Various effective dates; see sections 11, 21, 25, 129, and 131 of bill.",
      "dateSigned": "2008-04-22"
    },
    {
      "billNumber": "HF 2338",
      "billTitle": "A bill for an act relating to attendance at child in need of assistance proceedings. (FormerlyHSB 581) Effective 7-01-08.",
      "dateSigned": "2008-04-22"
    },
    {
      "billNumber": "HF 2620",
      "billTitle": "A bill for an act relating to the conduct of elections and voter registration, making penalties applicable, and including effective date, applicability date, and transition provisions. (FormerlyHSB 627) Effective 7-01-08, with exception of Division I effective 4-22-08.",
      "dateSigned": "2008-04-22"
    },
    {
      "billNumber": "SF 2161",
      "billTitle": "A bill for an act providing for the establishment of a council on homelessness.  (FormerlySSB 3052.)  Effective 7-1-08.",
      "dateSigned": "2008-04-24"
    },
    {
      "billNumber": "SF 2276",
      "billTitle": "A bill for an act relating to the disposal of solid waste by changing permitting requirements and updating and clarifying existing provisions. (FormerlySSB 3134.)  Effective 7-1-08.",
      "dateSigned": "2008-04-24"
    },
    {
      "billNumber": "SF 2350",
      "billTitle": "A bill for an act relating to trusts and estates including the administration of small estates, and including retroactive and other applicability provisions.  (FormerlySSB 3231.)  Effective 7-1-08.",
      "dateSigned": "2008-04-24"
    },
    {
      "billNumber": "SF 2354",
      "billTitle": "A bill for an act concerning the home ownership assistance program for members of the military.  (FormerlySF 2224.)  Effective 7-1-08.",
      "dateSigned": "2008-04-24"
    },
    {
      "billNumber": "SF 2427",
      "billTitle": "A bill for an act prohibiting certain lobbying activities of state agencies and providing a penalty.  Effective 7-1-08.",
      "dateSigned": "2008-04-24"
    },
    {
      "billNumber": "HF 2310",
      "billTitle": "A bill for an act requiring the departments of public health and human services to collect data and develop a protocol to address the relationship between substance misuse, abuse, or dependency by a child's parent, guardian, custodian, or other person responsible for the child's care and child abuse. (FormerlyHSB 568) Effective 7-01-08.",
      "dateSigned": "2008-04-25"
    },
    {
      "billNumber": "HF 2450",
      "billTitle": "A bill for an act relating to certain department of economic development programs including vision Iowa board membership, renewable fuels marketing, film project tax credits, the promotion of Iowa tourism experiences, the consolidation of reporting requirements, the administration of targeted industries development, and providing an effective date. (FormerlyHSB 557) Effective 7-01-08, with exception of section 17 effective 4-25-08.",
      "dateSigned": "2008-04-25"
    },
    {
      "billNumber": "HF 2555",
      "billTitle": "A bill for An Act relating to various matters under the purview of the insurance division of the department of commerce including uniform securities; duties of the insurance division including a consumer advocate and rate reviews; confidential information; examinations; insurance trade practices; insurance fraud; the Iowa life and health insurance guaranty association; viatical settlement contracts; general agents and third=party administrators; life insurance companies; health maintenance organizations; utilization and cost control; the Iowa comprehensive health insurance association; workers' compensation liability insurance; consolidation, merger, and reinsurance; licensing of insurance producers; cemetery and funeral merchandise and funeral services; and cemeteries, making appropriations, and providing an effective date. (FormerlyHSB 737) Effective 7-01-08, with exception of section 36 effective 4-25-08.",
      "dateSigned": "2008-04-25"
    },
    {
      "billNumber": "HF 2651",
      "billTitle": "A bill for an act relating to policies for the administration of highways and the regulation of motor vehicles and to deposits made by a county to the secondary road fund, physical ability tests required for fire fighter applicants, and certain obligations guaranteed by highway funds including matters concerning utility facility relocation due to highway construction, the bid threshold for emergency highway repairs, providing for new collegiate motor vehicle registration plates and providing fees, the fee for replacement of special dealer registration plates, antique motor vehicle registration fees, used motor vehicle dealer education requirements, penalties for speeding violations committed in road work zones, access to persons with disabilities parking spaces for certain disabled veterans, and permits and fees for the movement of certain oversize or overweight vehicles, drinking driver courses offered at state correctional facilities, establishment of benefited secondary road services districts, and the defeasance of petroleum underground storage tank fund bonds, and providing an effective date. (FormerlyHSB 648) Effective 7-01-08, with exception of sections 11, 13-15, 18, and 38 effective 4-25-08.",
      "dateSigned": "2008-04-25"
    },
    {
      "billNumber": "HF 2653",
      "billTitle": "A bill for an act relating to foreclosure consultants and foreclosure reconveyances, providing for criminal and civil penalties, and providing an effective date. (FormerlyHSB 747) Effective 4-25-08.",
      "dateSigned": "2008-04-25"
    },
    {
      "billNumber": "SF 517",
      "billTitle": "A bill for an act relating to the development, management, and efficient use of energy resources, making energy-related modifications to the state building code, setting fees, making appropriations, and providing an effective date.  (FormerlySF 288.)  Effective 4-29-08.",
      "dateSigned": "2008-04-29"
    },
    {
      "billNumber": "SF 2430",
      "billTitle": "A bill for an act relating to economic development by creating a community microenterprise development organization grant program, a microenterprise development advisory committee, and a river enhancement community attraction and tourism fund, and by making changes to the requirements for individual development accounts and making appropriations, and including effective and retroactive applicability provisions.  (FormerlySSB 3301.)  Various effective dates; see section 17 of bill.",
      "dateSigned": "2008-04-29"
    },
    {
      "billNumber": "SF 2216",
      "billTitle": "A bill for an act concerning state and local measures for preparing a student for a career or for postsecondary education, including a statewide core curriculum for school districts and accredited nonpublic schools and a state-designated career information and decision-making system.  (FormerlySSB 3097.) Effective 7-1-08.",
      "dateSigned": "2008-05-01"
    },
    {
      "billNumber": "SF 2405",
      "billTitle": "A bill for an act relating to renewable energy, providing for state bank acquisition of equity interests in wind energy production facilities, providing for qualification for specified tax credits and refunds by state banks and by owners or manufacturing facilities generating wind energy for on=site consumption rather than sale, providing for the establishment or participation in a program to track, record, or verify the trading of credits for electricity generated from specified sources, and providing effective and retroactive applicability dates.  (FormerlySF 2077&SF 2223.)  Effective 5-1-08.",
      "dateSigned": "2008-05-01"
    },
    {
      "billNumber": "SF 2124",
      "billTitle": "A bill for an act relating to income tax checkoffs and authorized expenditures from the veterans trust fund and providing for emergency rulemaking authority and including a retroactive applicability date provision and providing an effective date.  (FormerlySSB 3090.)  Effective 5-5-08.",
      "dateSigned": "2008-05-05"
    },
    {
      "billNumber": "SF 2134",
      "billTitle": "A bill for an act relating to veterans affairs by modifying training requirements, requiring executive directors and administrators to provide minimum hours of service in each county, specifying executive director, administrator, and employee duties, creating a county commission of veteran affairs training program, creating a county commissions of veteran affairs fund, providing an appropriation, concerning eligibility criteria for special gold star motor vehicle registration plates and providing an effective date.  (FormerlySSB 3033.)  Various effective dates; see section 10 of bill.",
      "dateSigned": "2008-05-05"
    },
    {
      "billNumber": "HF 2283",
      "billTitle": "A bill for an act concerning eligibility for receiving a Vietnam Conflict veterans bonus for a certain period of active duty military service, providing a penalty, and including an effective date. (FormerlyHF 2125) Effective 5-05-08.",
      "dateSigned": "2008-05-05"
    },
    {
      "billNumber": "HF 2690",
      "billTitle": "A bill for an act relating to student loans, including the protection of students and parents from certain lenders and institutions of higher education with conflicts of interest, establishing a student lending education fund, establishing penalties, and providing for properly related matters, and including an effective date. (FormerlyHSB 788) Effective 7-01-08, with exception of sections 5 and 7-9 effective 1-31-09.",
      "dateSigned": "2008-05-05"
    },
    {
      "billNumber": "SF 2386",
      "billTitle": "A bill for an act relating to energy efficiency by establishing a commission on energy efficiency standards and practices, providing for the reporting of energy efficiency results and savings by gas and electric public utilities, specifying procedures for assessing potential energy and capacity savings and developing energy efficiency goals by gas and electric utilities not subject to rate regulation, providing for the establishment or participation in a program to track, record, or verify the trading of credits for electricity generated from specified sources, and providing for the establishment of an interim study committee to conduct an examination of energy efficiency plans and programs with an emphasis on the demand or customer perspective, and providing an effective date.  (FormerlySF 2083.) Effective 5-6-08.",
      "dateSigned": "2008-05-06"
    },
    {
      "billNumber": "HF 2663",
      "billTitle": "A bill for an act relating to the repeal of the local option sales and services tax for school infrastructure purposes by using the revenues from the increase in the state sales and use taxes for replacing lost school district revenues resulting from the repeal, providing property tax relief, providing for the reduction in the state sales and use tax, providing a penalty, and including an effective date provision. (FormerlyHF 2066) Effective 7-01-08, with exception of section 72 effective 1-01-09.",
      "dateSigned": "2008-05-06"
    },
    {
      "billNumber": "SJR 2003",
      "billTitle": "A joint resolution authorizing the temporary use and consumption of alcoholic beverages on the state capitol complex grounds in conjunction with the Hy-Vee BG World Cup Triathlon, and providing an effective date. Effective 5-7-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SJR 2005",
      "billTitle": "A joint resolution authorizing the temporary use and consumption of wine and beer in the State Capitol, and the temporary display of ceremonial banners, in conjunction with the awards ceremony of the World Food Prize Foundation. Effective 7-1-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2203",
      "billTitle": "A bill for an act relating to contest events where an animal is injured, tormented, or killed, by providing a penalty for spectators.  (FormerlySF 2014.)  Effective 7-1-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2222",
      "billTitle": "A bill for an act relating to payment of wages.  (FormerlySSB 3047.) Effective 7-1-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2303",
      "billTitle": "A bill for an act relating to workers' compensation provisions for continued medically related benefits in certain settlements of workers' compensation claims and to funding of the second injury fund and providing an effective date.  (FormerlySSB 3218.) Effective 5-7-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2321",
      "billTitle": "A bill for an act relating to the recycling of mercury-containing lamps by providing for a study.  (FormerlySF 2225.)  Effective 7-1-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2337",
      "billTitle": "A bill for an act relating to the purchase of liability insurance and to self-insurance by the association of Iowa fairs.  (FormerlySF 2191.) Effective 7-1-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2341",
      "billTitle": "A bill for an act relating to Alzheimer's disease and similar forms of irreversible dementia.  (FormerlySSB 3203.)  Effective 7-1-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2348",
      "billTitle": "A bill for an act relating to the management of cooperative associations. (FormerlySSB 3221.)  Effective 7-1-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2413",
      "billTitle": "A bill for an act relating to school budgets, including by providing for requests and applications submitted by school districts to the school budget review committee and documents submitted to other state agencies concerning school district finances, and providing an effective date.  Effective 5-7-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2419",
      "billTitle": "A bill for an act relating to the property tax exemption for speculative shell buildings and including effective and retroactive applicability date provisions.  (FormerlySSB 3298.)  Effective 5-7-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2422",
      "billTitle": "A bill for an act relating to energy independence initiatives, specifying procedures applicable to Iowa power fund applications, authorizing allocations from the fund, directing that specified payments, repayments, or recaptures made to or received by the board shall be deposited in the fund, authorizing increased allocations for administrative costs, authorizing repayment of audit expenses to the auditor of state, and providing an effective date and applicability provision.  (FormerlySSB 3285.)  Effective 5-7-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2429",
      "billTitle": "A bill for an act relating to budget requirements by certain small cities and providing an effective date.  (FormerlySSB 3302.) Effective 5-7-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "HF 2197",
      "billTitle": "A bill for an act recommending institutions of higher learning to provide students with specific textbook information. (FormerlyHF 2015) Effective 7-01-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "HF 2266",
      "billTitle": "A bill for an act relating to the criminal offenses of eluding or attempting to elude a law enforcement vehicle and the possession of an incendiary or explosive device or material, and the regulation of explosives, and providing penalties. (FormerlyHSB 607) Effective 7-01-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "HF 2526",
      "billTitle": "A bill for an act relating to the disposition of school property.  (FormerlyHF 2083) Effective 7-01-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "HF 2558",
      "billTitle": "A bill for an act relating to economic development by providing for the confidentiality of certain details contained in contracts and applications for financial assistance. (FormerlyHSB 686) Effective 7-01-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "HF 2601",
      "billTitle": "A bill for an act providing for the state interagency Missouri river authority. (FormerlyHSB 758) Effective 7-01-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "HF 2628",
      "billTitle": "A bill for an act including a portable device or weapon directing an electric current, impulse, wave, or beam that produces a high-voltage pulse designed to immobilize a person in the definition of a dangerous weapon and making penalties applicable.  (FormerlyHSB 749) Effective 7-01-08.",
      "dateSigned": "2008-05-07"
    },
    {
      "billNumber": "SF 2415",
      "billTitle": "A bill for an act allowing certain counties to participate in a pilot project for emergency response districts and providing for a district tax levy.  (FormerlySSB 1329&SF 595.)  Effective 7-1-08.",
      "dateSigned": "2008-05-09"
    },
    {
      "billNumber": "SF 2432",
      "billTitle": "A bill for an act relating to and making appropriations to state departments and agencies from the rebuild Iowa infrastructure fund, the endowment for Iowa's health restricted capitals fund, the tax-exempt bond proceeds restricted capital funds account, the technology reinvestment fund, the FY 2009 tax-exempt bond proceeds restricted capital funds account, the environment first fund, and the FY 2009 prison bonding fund, and related matters, and providing effective and retroactive applicability date provisions.  (FormerlySSB 3303.)  Item veto.  Various effective dates; see sections 8, 36, and 59 of bill.",
      "dateSigned": "2008-05-09"
    },
    {
      "billNumber": "HF 2660",
      "billTitle": "A bill for an act relating to and making appropriations to the justice system. (FormerlyHSB 773) Item veto. Effective 7-01-08.",
      "dateSigned": "2008-05-09"
    },
    {
      "billNumber": "HF 2679",
      "billTitle": "A bill for an act relating to the funding of, the operation of, and appropriation of moneys to the college student aid commission, the department for the blind, the department of education, and the state board of regents, providing for related matters and including effective date provisions. (FormerlyHSB 787) Item veto. Effective 7-01-08, with exception of section 39 and Division III effective 5-09-08.",
      "dateSigned": "2008-05-09"
    },
    {
      "billNumber": "SF 2132",
      "billTitle": "A bill for an act relating to notices regarding the disposition of seized property and providing an effective date.  (FormerlySF 2012.)  Effective 5-10-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "SF 2308",
      "billTitle": "A bill for an act relating to identity theft by providing for the notification of a breach in the security of personal information requesting the establishment of an interim study committee relating to disclosure of personal information by public officials, entities, and affiliated organizations, and providing penalties.  (FormerlySSB 3200.)   Effective 7-1-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "SF 2392",
      "billTitle": "A bill for an act to regulate viatical settlements, and providing for fees and penalties.  (FormerlySSB 3238.)  Effective 7-1-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "SF 2406",
      "billTitle": "A bill for an act relating to appointments by members of the general assembly to statutory boards, commissions, councils, and committees, abolishing certain related entities, and including effective date and applicability provisions.  Effective 5-10-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "SF 2418",
      "billTitle": "A bill for an act relating to notice provided to certain households about the availability of volunteer or free income tax assistance programs and the federal and state earned income tax credits.  (FormerlySSB 3299.) Effective 7-1-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "HF 2177",
      "billTitle": "A bill for an act relating to the placement of deer transportation tags on antlered deer that have been taken pursuant to a deer hunting license. (FormerlyHF 2048) Effective 7-01-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "HF 2367",
      "billTitle": "A bill for an act relating to the tally of absentee votes by precinct at certain elections. (FormerlyHF 2132) Effective 7-01-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "HF 2556",
      "billTitle": "A bill for an act relating to the regulatory duties of the banking division of the department of commerce regarding banking, debt management, delayed deposit services, mortgage banking, and industrial loan companies, and providing penalties. (FormerlyHSB 634) Effective 7-01-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "HF 2612",
      "billTitle": "A bill for an act relating to natural resources, including by providing for the powers and duties of the department's director and natural resource commission, and the regulation of public lands, waters, and outdoor recreation, providing for fees, providing for penalties and making penalties applicable and providing an effective date. (FormerlyHSB 764) Effective 7-01-08, with exception of Division IV effective 5-10-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "HF 2633",
      "billTitle": "A bill for an act relating to business associations, by providing for limited liability companies and conversion involving corporations, providing fees and penalties, and providing an effective date. (FormerlyHSB 748) Effective 1-01-09, with exception of section 154 effective 12-31-10.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "HF 2647",
      "billTitle": "A bill for an act relating to and making appropriations to the judicial branch. (FormerlyHSB 772) Effective 7-01-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "HF 2672",
      "billTitle": "A bill for an act relating to water use permit fees, creating a new water use permit fund, and making appropriations. (FormerlyHF 2654) (FormerlyHSB 691) Effective 7-01-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "HF 2673",
      "billTitle": "A bill for an act relating to the inheritance tax on any interest in a qualified tuition plan. (FormerlyHF 2520) Effective 7-01-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "HF 2674",
      "billTitle": "A bill for an act concerning appropriations to the office of grants enterprise management and including an effective date provision.  (FormerlyHF 917) (FormerlyHSB 312) Effective 5-10-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "HF 2685",
      "billTitle": "A bill for an act relating to rules for the discharge of wastewater from water well drilling sites and providing for a fee. (FormerlyHF 2518) (FormerlyHSB 647) Effective 7-01-08.",
      "dateSigned": "2008-05-10"
    },
    {
      "billNumber": "SF 2400",
      "billTitle": "A bill for an act relating to and making appropriations to certain state departments, agencies, funds, and certain other entities, providing for regulatory authority, and other properly related matters and providing an effective and retroactive applicability date. (FormerlySSB 3264.) Item veto.  Various effective dates; see section 28 of bill.",
      "dateSigned": "2008-05-12"
    },
    {
      "billNumber": "HF 901",
      "billTitle": "A bill for an act concerning the training and certification of designated security personnel working at commercial establishments with a liquor control license or wine or beer permit and providing for fees. (FormerlyHF 850) (FormerlyHF 281) Effective 7-01-08.",
      "dateSigned": "2008-05-12"
    },
    {
      "billNumber": "HF 2668",
      "billTitle": "A bill for an act relating to the disposal and recycling of used oil filters. (FormerlyHF 2525) (FormerlyHF 2273) Effective 7-01-08.",
      "dateSigned": "2008-05-12"
    },
    {
      "billNumber": "HF 2669",
      "billTitle": "A bill for an act relating to the collection and recycling of mercury-added thermostats. (FormerlyHF 2329) (FormerlyHF 751) Effective 7-01-08.",
      "dateSigned": "2008-05-12"
    },
    {
      "billNumber": "HF 2689",
      "billTitle": "A bill for an act relating to renewable fuel, including by providing for infrastructure associated with storing, blending, and dispensing renewable fuel, providing for tax credits, , providing for the purchase of renewable fuels by governmental entities, providing for renewable fuel marketing efforts, and providing for effective dates and applicability. (FormerlyHF 2632) (FormerlyHSB 746) Effective 5-12-08, with exception of section 7 effective 1-01-09.",
      "dateSigned": "2008-05-12"
    },
    {
      "billNumber": "SF 2394",
      "billTitle": "A bill for an act relating to and making transportation and other infrastructure-related appropriations to the department of transportation, including allocation and use of moneys from the road use tax fund and the primary road fund, and including an effective date.  (FormerlySSB 3265.) Various effective dates; see section 4 of bill.",
      "dateSigned": "2008-05-13"
    },
    {
      "billNumber": "SF 2417",
      "billTitle": "A bill for an act relating to and making appropriations from the healthy Iowans tobacco trust and the tobacco settlement trust fund, and providing for the repeal of the healthy Iowans tobacco trust, and providing effective dates.  (FormerlySSB 3295.)  Item veto.  Various effective dates; see sections 8 and 19 of bill.",
      "dateSigned": "2008-05-13"
    },
    {
      "billNumber": "SF 2425",
      "billTitle": "A bill for an act relating to and making appropriations for health and human services and including other related provisions and appropriations, providing penalties, making penalties applicable and providing effective, retroactive, and applicability date provisions.  (FormerlySSB 3297.)  Item veto.  Various effective dates; see sections 38, 97, 104, and 145 of bill.",
      "dateSigned": "2008-05-13"
    },
    {
      "billNumber": "HF 2539",
      "billTitle": "A bill for an act relating to health care reform including health care coverage intended for children and adults, health information technology, long-term living planning and patient autonomy in health care, preexisting conditions and dependent children coverage, medical homes, prevention and chronic care management, disease prevention and wellness initiatives, health care transpar health care access, the direct care workforce, making appropriations, and including effective date and applicability provisions. (FormerlyHSB 737) Effective 7-01-08, with exception of section 67 and Division XV effective 5-13-08.",
      "dateSigned": "2008-05-13"
    },
    {
      "billNumber": "HF 2662",
      "billTitle": "A bill for an act relating to and making appropriations involving state government, by providing for agriculture, natural resources, and environmental protection. (FormerlyHSB 784) Effective 7-01-08.",
      "dateSigned": "2008-05-13"
    },
    {
      "billNumber": "HF 2699",
      "billTitle": "A bill for an act relating to and making appropriations to the department of cultural affairs, the department of economic development, certain board of regents institutions, the department of workforce development, and the public employment relations board, and related matters and providing effective dates. Effective 7-01-08, with exception of sections 26-29 effective 5-13-08.",
      "dateSigned": "2008-05-13"
    },
    {
      "billNumber": "SF 2160",
      "billTitle": "A bill for an act relating to employers' participation in unemployment insurance adjudications and unemployment insurance tax penalties, and providing an effective date.  (FormerlySSB 3045.) Various effective dates; see section 5 of bill.",
      "dateSigned": "2008-05-15"
    },
    {
      "billNumber": "SF 2424",
      "billTitle": "A bill for an act concerning public retirement systems and other employee benefit-related matters, including the public safety peace officers' retirement, accident, and disability system, the Iowa public employees' retirement system, the statewide fire and police retirement system, and the judicial retirement system, including implementation and transition provisions, and providing effective and retroactive applicability dates. (FormerlySSB 3300.)  Various effective dates; see sections 49 and 68 of bill.",
      "dateSigned": "2008-05-15"
    },
    {
      "billNumber": "SF 2428",
      "billTitle": "A bill for an act relating to the collection of delinquent debt owed the state and political subdivisions of the state by requiring offsets of gambling winnings, sanctioning of professional licenses, modifying provisions related to debt and tax collection practices and fees, writing off certain delinquent court debt, modifying provisions relating to the deposit of certain funds in the jury and witness fee fund, and making penalties applicable.  (FormerlySSB 3279.)  Effective 7-1-08.",
      "dateSigned": "2008-05-15"
    },
    {
      "billNumber": "HF 2687",
      "billTitle": "A bill for an act relating to certain economic development programs by providing tax credits for the redevelopment of underutilized properties. (FormerlyHF 2351) Effective 7-01-08.",
      "dateSigned": "2008-05-15"
    },
    {
      "billNumber": "HF 2688",
      "billTitle": "A bill for an act providing for efforts to mitigate odor emitted from a livestock operation including by providing for basic and applied research and evaluations, providing for implementation, and including applicability and effective date provisions. (FormerlyHF 2652) (FormerlyHSB 679) Effective 7-01-08, with exception of section 11 effective 1-01-09.",
      "dateSigned": "2008-05-15"
    },
    {
      "billNumber": "HF 2694",
      "billTitle": "A bill for an act relating to long-term care insurance, and providing for penalties, an applicability date, repeals, and an appropriation and providing an effective date. (FormerlyHSB 793) Effective 7-01-08, with exception of sections 10-11 effective 1-01-09.",
      "dateSigned": "2008-05-15"
    },
    {
      "billNumber": "HF 2700",
      "billTitle": "A bill for an act relating to state and local finances by providing for funding of property tax credits and reimbursements, by making, increasing and reducing appropriations, providing for salaries and compensation of state employees, providing for matters relating to tax credits, providing for fees and penalties, and providing for properly related matters, and including effective and retroactive applicability date provisions. (FormerlyHSB 797) Item veto.  Various effective dates, see bill.",
      "dateSigned": "2008-05-15"
    }
  ]
}