{
  "year": 2005,
  "totalBills": 181,
  "bills": [
    {
      "billNumber": "SF 36",
      "billTitle": "A bill for an act providing for the establishment of the state percent of growth for purposes of the state school foundation program and providing an applicability date.  (FormerlySSB 1019.) Effective 7-1-05.",
      "dateSigned": "2005-02-02"
    },
    {
      "billNumber": "HF 102",
      "billTitle": "A bill for an act relating to state income taxes by authorizing individuals, corporations, and financial institutions to elect to take the additional first-year depreciation allowance and to allow the additional first-year depreciation allowance and the increased expensing allowance which were deductible for a tax year for which a tax return was filed prior to a certain date to be deducted on the return filed for the subsequent tax year and including an effective date provision and a retroactive applicability date provision. Effective 02-24-05.",
      "dateSigned": "2005-02-24"
    },
    {
      "billNumber": "SF 113",
      "billTitle": "A bill for an act relating to nonsubstantive Code corrections and including effective and retroactive applicability date provisions.  Various effective dates; see section 118 of bill.",
      "dateSigned": "2005-03-03"
    },
    {
      "billNumber": "HF 175",
      "billTitle": "A bill for an act relating to the names of business entities.  Effective 07-01-05.",
      "dateSigned": "2005-03-03"
    },
    {
      "billNumber": "HF 197",
      "billTitle": "A bill for an act relating to inheritance tax by eliminating the requirement that the department of revenue receive notice of withdrawal of funds from a joint account by a surviving joint owner. Effective 07-01-05.",
      "dateSigned": "2005-03-03"
    },
    {
      "billNumber": "SF 75",
      "billTitle": "A bill for an act allocating funding appropriated to assist individuals assigned to active duty military service and providing effective and applicability date provisions.  (FormerlySF 30.) Effective 3-10-05.",
      "dateSigned": "2005-03-10"
    },
    {
      "billNumber": "HF 190",
      "billTitle": "A bill for an act expanding the duties of the child death review team and making a penalty applicable. Effective 7-01-05.",
      "dateSigned": "2005-03-11"
    },
    {
      "billNumber": "SF 114",
      "billTitle": "A bill for an act relating to tax credit certificates issued by the Iowa capital investment board and providing an effective date.  (FormerlySSB 1064.)  Effective 3-14-05.",
      "dateSigned": "2005-03-14"
    },
    {
      "billNumber": "HF 216",
      "billTitle": "A bill for an act relating to motor vehicle regulation by the state department of transportation, including motor vehicle registration and titling, restricted and special driver's licenses for minors, driver licensing, regulation of commercial vehicles, the use of flashing lights on certain vehicles, citations for child restraint violations, permits for vehicles of excessive height or weight, procedures for motor vehicle dealers, and persons with disabilities parking, and relating to refunds of taxes on motor fuel used in taxicabs and buses that provide certain services. Effective 07-01-05.",
      "dateSigned": "2005-03-15"
    },
    {
      "billNumber": "HF 277",
      "billTitle": "A bill for an act relating to the deregulation of communications services including considering market forces, eliminating accounting plan requirements, establishing antitrust procedures and remedies, eliminating reporting requirements, and providing a penalty. Effective 07-01-05.",
      "dateSigned": "2005-03-15"
    },
    {
      "billNumber": "HF 418",
      "billTitle": "A bill for an act concerning billing for anatomic pathology services and making licensing sanctions applicable. Effective 07-01-05.",
      "dateSigned": "2005-03-15"
    },
    {
      "billNumber": "SF 139",
      "billTitle": "A bill for an act relating to negotiable instruments, by providing for liabilities among certain parties, and providing a statute of limitations. (FormerlySSB 1069.)  Effective 7-1-05.",
      "dateSigned": "2005-03-21"
    },
    {
      "billNumber": "SF 141",
      "billTitle": "A bill for an act relating to reimbursement to owners of aboveground petroleum storage tanks for costs associated with the upgrade or permanent closure of aboveground petroleum storage tanks.  Effective 7-1-05.",
      "dateSigned": "2005-03-21"
    },
    {
      "billNumber": "HF 141",
      "billTitle": "A bill for an act relating to the training and certification of designated security personnel working at commercial establishments with a liquor control license or wine or beer permit. Effective 07-01-05.",
      "dateSigned": "2005-03-21"
    },
    {
      "billNumber": "HF 281",
      "billTitle": "A bill for an act relating to certain penalties for filing false affidavits and the time for examining and determining a correct return under the state inheritance tax and increasing the amount of property that may be transferred to minors under certain conditions and including a retroactive applicability date provision. Effective 07-01-05.",
      "dateSigned": "2005-03-21"
    },
    {
      "billNumber": "SF 169",
      "billTitle": "A bill for an act relating to the regulation of substances which are precursors to amphetamine and methamphetamine and providing a penalty and effective dates.  Various effective dates; see section 14 of bill.",
      "dateSigned": "2005-03-22"
    },
    {
      "billNumber": "SF 71",
      "billTitle": "A bill for an act relating to an appropriation from the environment first fund for the establishment of permanent soil and water conservation practices, by allocating moneys to support the administration of local governmental units, and providing an effective date.  (FormerlySSB 1024.) Effective 3-31-05.",
      "dateSigned": "2005-03-31"
    },
    {
      "billNumber": "SF 205",
      "billTitle": "A bill for an act providing for life science enterprises authorized to hold agricultural land, making penalties applicable, and providing an effective date.  (FormerlySSB 1105.)  Effective 4-6-05.",
      "dateSigned": "2005-04-06"
    },
    {
      "billNumber": "SF 264",
      "billTitle": "A bill for an act relating to the funding of the dual party relay service through assessments on telecommunications carriers providing telephone service.  (FormerlySSB 1047.)  Effective 7-1-05.",
      "dateSigned": "2005-04-06"
    },
    {
      "billNumber": "SF 270",
      "billTitle": "A bill for an act relating to identity theft including criminal violations and damages recoverable in a civil action, providing for forfeiture of property and for certain rights of financial institutions, and providing for civil remedies.  (FormerlySSB 1206.)  Effective 7-1-05.",
      "dateSigned": "2005-04-06"
    },
    {
      "billNumber": "HF 227",
      "billTitle": "A bill for an act relating to statutory corrections which may adjust language to reflect current practices, insert earlier omissions, delete redundancies and inaccuracies, delete temporary language, resolve inconsistencies and conflicts, update ongoing provisions, or remove ambiguities, and including effective and retroactive applicability date provisions. Effective 07-01-05, with exception of sections 122-124, effective 04-06-05.",
      "dateSigned": "2005-04-06"
    },
    {
      "billNumber": "HF 591",
      "billTitle": "A bill for an act relating to state department of transportation duties concerning its budget, distribution of state institutional road funds, vehicle weight and length restrictions, all- terrain vehicle use, evidence of interstate authority and penalties, and providing an effective date. Effective 07-01-05, with exception of sections 5-9, effective 04-06-05.",
      "dateSigned": "2005-04-06"
    },
    {
      "billNumber": "HF 642",
      "billTitle": "A bill for an act relating to the regulation of agricultural seed, by providing for preemption of local legislation. Effective 07-01-05.",
      "dateSigned": "2005-04-06"
    },
    {
      "billNumber": "SF 74",
      "billTitle": "A bill for an act relating to financial institutions and insurers, by prohibiting the deceptive use of name, and providing remedies and penalties. Effective 7-1-05.",
      "dateSigned": "2005-04-13"
    },
    {
      "billNumber": "SF 215",
      "billTitle": "A bill for an act modifying the certified mail requirement concerning the service and delivery of certain civil rights complaints and orders. (FormerlySSB 1132.)  Effective 7-1-05.",
      "dateSigned": "2005-04-13"
    },
    {
      "billNumber": "HF 186",
      "billTitle": "A bill for an act updating the Code references to the Internal Revenue Code and including retroactive applicability and effective date provisions. Effective 04-13-05.",
      "dateSigned": "2005-04-13"
    },
    {
      "billNumber": "HF 187",
      "billTitle": "A bill for an act relating to the utility replacement tax task force. Effective 07-01-05.",
      "dateSigned": "2005-04-13"
    },
    {
      "billNumber": "HF 332",
      "billTitle": "A bill for an act allowing certain abstractors to request a mortgage release. Effective 07-01-05.",
      "dateSigned": "2005-04-13"
    },
    {
      "billNumber": "HF 373",
      "billTitle": "A bill for an act relating to equipment dealerships, by providing for the sale or transfer of a dealership and providing for the Act's applicability. Effective 07-01-05.",
      "dateSigned": "2005-04-13"
    },
    {
      "billNumber": "HF 466",
      "billTitle": "A bill for an act relating to and making transportation and other infrastructure-related appropriations to the state department of transportation, including allocation and use of moneys from the road use tax fund, the primary road fund, and the general fund.  Effective 07-01-05.",
      "dateSigned": "2005-04-14"
    },
    {
      "billNumber": "HF 131",
      "billTitle": "A bill for an act relating to the required education and training for dental assistants. Effective 07-01-05.",
      "dateSigned": "2005-04-15"
    },
    {
      "billNumber": "HF 291",
      "billTitle": "A bill for an act relating to accounts and fees under the water quality protection fund. Effective 07-01-05.",
      "dateSigned": "2005-04-15"
    },
    {
      "billNumber": "HF 370",
      "billTitle": "A bill for an act allowing the Iowa finance authority to issue qualified residential rental project bonds under the private activity bond allocation Act. Effective 07-01-05.",
      "dateSigned": "2005-04-15"
    },
    {
      "billNumber": "HF 399",
      "billTitle": "A bill for an act relating to the disposal of solid waste by planning areas and related solid waste management plans and reports. Effective 07-01-05.",
      "dateSigned": "2005-04-15"
    },
    {
      "billNumber": "HF 581",
      "billTitle": "A bill for an act relating to interstate natural gas pipelines including requirements regarding construction, operation, and maintenance, applicable penalties and resultant damages, and easements. Effective 07-01-05.",
      "dateSigned": "2005-04-15"
    },
    {
      "billNumber": "HF 602",
      "billTitle": "A bill for an act relating to the collection, transportation, and disposal of household hazardous waste. Effective 07-01-05.",
      "dateSigned": "2005-04-15"
    },
    {
      "billNumber": "SJR 6",
      "billTitle": "A joint resolution authorizing the temporary use and consumption of wine in the State Capitol in conjunction with the awards ceremony of the World Food Prize Foundation.  Effective 7-1-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "SJR 7",
      "billTitle": "A joint resolution authorizing the temporary use and consumption of wine and beer in the State Capitol in conjunction with the 2005 National Governors Association Annual Meeting.  Effective 7-1-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "SF 265",
      "billTitle": "A bill for an act relating to delinquent property taxes and other duties of the county treasurer and including effective date and applicability date provisions.  (FormerlySF 170.)  Effective 4-19-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "SF 283",
      "billTitle": "A bill for an act relating to the department of public safety by updating references, changing the names of divisions in the department, and changing practices and procedures.  (FormerlySSB 1108.)  Effective 7-1-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "SF 320",
      "billTitle": "A bill for an act requiring performance of a criminal history check of applicants for real estate broker and salesperson licenses.  (FormerlySF 194.)  Effective 7-1-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "SF 339",
      "billTitle": "A bill for an act relating to regional transit districts.  (FormerlySSB 1239.)  Effective 7-1-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "SF 346",
      "billTitle": "A bill for an act appropriating federal funds made available from federal block grants and other federal grants, allocating portions of federal block grants, and providing procedures if federal funds are more or less than anticipated or if federal block grants are more or less than anticipated. (FormerlySSB 1184.)  Effective 7-1-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "SF 379",
      "billTitle": "A bill for an act relating to the Iowa probate code, the Iowa trust code, and certain other trusts.  (FormerlySSB 1251.)  Effective 7-1-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "HF 252",
      "billTitle": "A bill for an act relating to the control of noxious weeds on land by providing alternative notice procedures to landowners and other responsible persons. Effective 07-01-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "HF 375",
      "billTitle": "A bill for an act relating to the duties imposed on a real estate broker by a brokerage agreement. Effective 07-01-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "HF 469",
      "billTitle": "A bill for an act increasing the membership of the real estate commission. Effective 07-01-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "HF 478",
      "billTitle": "A bill for an act relating to the Iowa commission on volunteer service. Effective 07-01-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "HF 580",
      "billTitle": "A bill for an act relating to the administration of the Iowa egg council, including by providing for the use, promotion, and research of eggs and egg products, and providing for an assessment.  Effective 07-01-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "HF 826",
      "billTitle": "A bill for an act relating to the speed limit for vehicular traffic on highways, the fines for violations, and court costs for simple misdemeanor offenses and providing a fee and making appropriations.  Effective 07-01-05.",
      "dateSigned": "2005-04-19"
    },
    {
      "billNumber": "SF 260",
      "billTitle": "A bill for an act relating to debt collection disclosure requirements for certain financial institution affiliates.  (FormerlySSB 1099.)  Effective 7-1-05.",
      "dateSigned": "2005-04-22"
    },
    {
      "billNumber": "SF 304",
      "billTitle": "A bill for an act relating to the provisions of the elder Iowans Act. (FormerlySSB 1140.)  Effective 7-1-05.",
      "dateSigned": "2005-04-22"
    },
    {
      "billNumber": "SF 335",
      "billTitle": "A bill for an act relating to access to dependent adult abuse information and unemployment compensation claims.  (FormerlySSB 1051.)  Effective 7-1-05.",
      "dateSigned": "2005-04-22"
    },
    {
      "billNumber": "HF 613",
      "billTitle": "A bill for an act relating to the regulation of hot water heating boilers for swimming pools and spas. Effective 07-01-05.",
      "dateSigned": "2005-04-22"
    },
    {
      "billNumber": "HF 641",
      "billTitle": "A bill for an act concerning the determination of state regulatory fees on excursion gambling boats relating to the number of gaming enforcement officers on larger excursion gambling boats. Effective 07-01-05.",
      "dateSigned": "2005-04-22"
    },
    {
      "billNumber": "HF 726",
      "billTitle": "A bill for an act allowing a physician assistant and an advanced registered nurse practitioner to certify an alleged intoxicated driver's incapacitated state for purposes of chemical testing.  Effective 07-01-05.",
      "dateSigned": "2005-04-22"
    },
    {
      "billNumber": "HF 760",
      "billTitle": "A bill for an act relating to dependent adults and the provision of protective services. Effective 07-01-05.",
      "dateSigned": "2005-04-22"
    },
    {
      "billNumber": "HF 768",
      "billTitle": "A bill for an act relating to the publishing of notice of recommendations to grant permits for diversion, storage, and withdrawal of water. Effective 07-01-05.",
      "dateSigned": "2005-04-22"
    },
    {
      "billNumber": "HF 776",
      "billTitle": "A bill for an act relating to governmental financial and information technology activities, including membership in state insurance plans by former members of the general assembly, designation of a chief information officer for the state, cooperative procurement agreements, distribution of state employee salary information, setoff authority for capitol complex and state laboratory parking fines collection, sales of disposed personal property of the state by not-for-profit organizations, a local government setoff authority pilot project, and providing for a study concerning credit card payments accepted by government.  Effective 07-01-05.",
      "dateSigned": "2005-04-22"
    },
    {
      "billNumber": "HF 784",
      "billTitle": "A bill for an act to establish an advanced practice registered nurse compact and including a future repeal. Effective 07-01-05.",
      "dateSigned": "2005-04-22"
    },
    {
      "billNumber": "SF 340",
      "billTitle": "A bill for an act relating to motor vehicle registration and driver licensing services provided by county treasurers and providing for the collection of certain fees, fines, and penalties, and providing an effective date.  Effective 7-1-07.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "SF 352",
      "billTitle": "A bill for an act relating to confidentiality and liability provisions involving the child advocacy board and the programs associated with the board and making a penalty applicable.  (FormerlySSB 1080.)  Effective 7-1-05.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "SF 363",
      "billTitle": "A bill for an act providing for the regulation of persons engaged in soliciting business opportunities, including franchises.  (FormerlySSB 1226.)  Effective 7-1-05.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "SF 365",
      "billTitle": "A bill for an act relating to the application deadline for certification of enterprise zones.  (FormerlySSB 1282.)  Effective 7-1-05.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "SF 370",
      "billTitle": "A bill for an act relating to the duration of a no-contact order in a criminal case.  (FormerlySSB 1152.)  Effective 7-1-05.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "HF 276",
      "billTitle": "A bill for an act requiring that meetings relating to postsecondary school registration held by the Iowa coordinating council for post- high school education be open to the public. Effective 07-01-05.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "HF 585",
      "billTitle": "A bill for an act relating to assisted living programs, providing for a fee, providing penalties, and providing an effective date.  Effective 04-27-05.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "HF 587",
      "billTitle": "A bill for an act relating to adult day services regulation, providing penalties, and providing an effective date.  Effective 04-27-05.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "HF 710",
      "billTitle": "A bill for an act relating to the regulation of elder group homes and providing penalties. Effective 07-01-05.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "HF 717",
      "billTitle": "A bill for an act prohibiting the unauthorized sale, ownership, possession, or use of traffic signal preemption devices and providing a penalty. Effective 07-01-05.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "HF 757",
      "billTitle": "A bill for an act relating to the disposition of abandoned vehicles. Effective 07-01-05.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "HF 771",
      "billTitle": "A bill for an act relating to the timing of a mental competency hearing for a person accused of a criminal offense. Effective 07-01-05.",
      "dateSigned": "2005-04-27"
    },
    {
      "billNumber": "SF 57",
      "billTitle": "A bill for an act authorizing the appointment of a nine-member city zoning board of adjustment.  (FormerlySF 25.)  Effective 7-1-05.",
      "dateSigned": "2005-04-28"
    },
    {
      "billNumber": "SF 321",
      "billTitle": "A bill for an act relating to the use of moneys deposited into the inmate labor fund.  (FormerlySSB 1228.)  Effective 7-1-05.",
      "dateSigned": "2005-04-28"
    },
    {
      "billNumber": "SF 323",
      "billTitle": "A bill for an act establishing a uniform mediation Act.  (FormerlySSB 1170.)  Effective 7-1-05.",
      "dateSigned": "2005-04-28"
    },
    {
      "billNumber": "SF 330",
      "billTitle": "A bill for an act relating to family law provisions including dissolution of marriage and domestic relations and termination of parental rights provisions.  (FormerlySSB 1070.)  Effective 7-1-05.",
      "dateSigned": "2005-04-28"
    },
    {
      "billNumber": "SF 360",
      "billTitle": "A bill for an act relating to various provisions administered by the insurance division of the department of commerce concerning premium tax refunds, the interstate insurance compact, insurer insolvency proceedings, individual health insurance, the small employer carrier reinsurance program, insurance applications, the Iowa comprehensive health association, fire insurance policies, the Iowa insurance guaranty association, the FAIR plan, motor vehicle service contracts, investments by county and state mutual associations, reciprocal or interinsurance contract premium rates, unauthorized activity of insurance producers, and annuity contracts for cemetery and funeral merchandise and funeral services, and making fees and penalties applicable and providing effective and retroactive applicability dates.  Various effective dates; see section 51 of bill.",
      "dateSigned": "2005-04-28"
    },
    {
      "billNumber": "HF 310",
      "billTitle": "A bill for an act exempting the sale of toys to certain nonprofit organizations from state sales and use taxes. Effective 07-01-05.",
      "dateSigned": "2005-04-28"
    },
    {
      "billNumber": "HF 312",
      "billTitle": "A bill for an act relating to campaign finance committee reporting, use of committee funds or property, independent expenditures, and placement of campaign signs. Effective 07-01-05.",
      "dateSigned": "2005-04-28"
    },
    {
      "billNumber": "HF 476",
      "billTitle": "A bill for an act regulating the sale of ammonium nitrate by fertilizer dealers, and providing penalties. Effective 07-01-05.",
      "dateSigned": "2005-04-28"
    },
    {
      "billNumber": "HF 607",
      "billTitle": "A bill for an act relating to emergency services provided to residents of certain townships and including effective date and retroactive applicability date provisions. Effective 04-28-05.",
      "dateSigned": "2005-04-28"
    },
    {
      "billNumber": "HF 748",
      "billTitle": "A bill for an act providing for state employee payroll deductions for qualified tuition program contributions. Effective 07-01-05.",
      "dateSigned": "2005-04-28"
    },
    {
      "billNumber": "HF 253",
      "billTitle": "A bill for an act relating to governmental ethics and the duties of the Iowa ethics and campaign disclosure board. Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 313",
      "billTitle": "A bill for an act relating to the establishment of an industrial processing exemption study committee and including an effective date. Effective 04-29-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 398",
      "billTitle": "A bill for an act adding an exemption for colleges and universities established by city ordinance to the requirements relating to the registration of postsecondary schools. Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 423",
      "billTitle": "A bill for an act relating to participation in secondary school interscholastic sports at the varsity and inferior levels.  Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 532",
      "billTitle": "A bill for an act relating to the administrative functions of the department of cultural affairs, including the board of trustees of the state historical society of Iowa and the state records commission. Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 645",
      "billTitle": "A bill for an act relating to the regulation of lotteries, including the definition of a lottery, permissible lotteries by commercial organizations, and the prosecution of violators.  Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 700",
      "billTitle": "A bill for an act relating to the Iowa soybean association, by providing for its board of directors, market development, and providing for an assessment. Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 737",
      "billTitle": "A bill for an act relating to the registration and licensing of mortgage bankers and brokers, providing for fees, and providing an effective date. Effective 07-01-06.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 745",
      "billTitle": "A bill for an act relating to the criminal offense of theft of leased or rented personal property and making penalties applicable.  Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 746",
      "billTitle": "A bill for an act providing procedures for a rural water district to transfer its right to provide water or wastewater service and for dissolution of the district. Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 754",
      "billTitle": "A bill for an act relating to a homestead exemption waiver notice contained in a written contract affecting agricultural land.  Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 777",
      "billTitle": "A bill for an act relating to testing a person for contagious or infectious disease if the person assaults a person by exchanging or attempting to exchange bodily fluids, and providing a penalty.  Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 781",
      "billTitle": "A bill for an act relating to the establishment of a direct care worker task force. Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 789",
      "billTitle": "A bill for an act relating to programs and functions under the purview of the Iowa department of public health. Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 839",
      "billTitle": "A bill for an act providing for the establishment of a technology governance board within the department of administrative services, and making an appropriation. Effective 07-01-05.",
      "dateSigned": "2005-04-29"
    },
    {
      "billNumber": "HF 420",
      "billTitle": "A bill for an act relating to third-party payment of health care coverage costs for biologically based mental illness treatment services. Effective 07-01-05.",
      "dateSigned": "2005-05-02"
    },
    {
      "billNumber": "HF 819",
      "billTitle": "A bill for an act relating to asset disregard under the medical assistance program for the purchase of a certified long-term care insurance policy, providing for a repeal, providing a contingent effective date, and providing an appropriation. Effective 07-01-05.",
      "dateSigned": "2005-05-02"
    },
    {
      "billNumber": "SF 313",
      "billTitle": "A bill for an act relating to traffic citations issued for school bus warning device and railroad crossing violations.  Effective 7-1-05.",
      "dateSigned": "2005-05-03"
    },
    {
      "billNumber": "HF 339",
      "billTitle": "A bill for an act relating to the regulation of tobacco product retailers, and making penalties applicable. Effective 07-01-05.",
      "dateSigned": "2005-05-03"
    },
    {
      "billNumber": "HF 614",
      "billTitle": "A bill for an act relating to the transmission, installation, and use of computer software through deceptive or unauthorized means and providing for penalties. Effective 07-01-05.",
      "dateSigned": "2005-05-03"
    },
    {
      "billNumber": "HF 616",
      "billTitle": "A bill for an act revising requirements applicable to county and multicounty decategorization of child welfare and juvenile justice funding projects. Effective 07-01-05.",
      "dateSigned": "2005-05-03"
    },
    {
      "billNumber": "HF 617",
      "billTitle": "A bill for an act relating to inclusion of assisted living services under the medical assistance home and community-based services waiver for the elderly. Effective 07-01-05.",
      "dateSigned": "2005-05-03"
    },
    {
      "billNumber": "HF 724",
      "billTitle": "A bill for an act creating a prescription drug donation repository program. Effective 07-01-05.",
      "dateSigned": "2005-05-03"
    },
    {
      "billNumber": "HF 764",
      "billTitle": "A bill for an act relating to the unemployment rate of contribution of a person who acquires an organization, trade, or business and providing penalties. Effective 07-01-05.",
      "dateSigned": "2005-05-03"
    },
    {
      "billNumber": "HF 772",
      "billTitle": "A bill for an act relating to violations of the open meetings and open records law by a member of a governmental body, the lawful custodian of a public record, or any other appropriate person.  Effective 07-01-05.",
      "dateSigned": "2005-05-03"
    },
    {
      "billNumber": "HF 814",
      "billTitle": "A bill for an act relating to electronic notices of bidding opportunities for state purchases. Effective 07-01-05.",
      "dateSigned": "2005-05-03"
    },
    {
      "billNumber": "SF 210",
      "billTitle": "A bill for an act relating to specified requirements applicable to a real estate broker or attorney providing services in connection with a real estate auction.  (FormerlySSB 1005.)  Effective 7-1-05.",
      "dateSigned": "2005-05-04"
    },
    {
      "billNumber": "SF 375",
      "billTitle": "A bill for an act creating the uniform environmental covenants Act. (FormerlySSB 1125.)  Effective 7-1-05.",
      "dateSigned": "2005-05-04"
    },
    {
      "billNumber": "SF 403",
      "billTitle": "A bill for an act providing for the receipt of and costs relating to public records requests.  (FormerlySSB 1295.)  Effective 7-1-05.",
      "dateSigned": "2005-05-04"
    },
    {
      "billNumber": "SF 405",
      "billTitle": "A bill for an act establishing an interior design examining board, providing for the registration of interior designers, and providing fees and penalties.  (FormerlySSB 1247&SF 334.)  Effective 7-1-05.",
      "dateSigned": "2005-05-04"
    },
    {
      "billNumber": "HF 275",
      "billTitle": "A bill for an act relating to the purchase, possession, or consumption of alcohol by a person under legal age, and providing a penalty. Effective 07-01-05.",
      "dateSigned": "2005-05-04"
    },
    {
      "billNumber": "HF 646",
      "billTitle": "A bill for an act concerning social and charitable gambling, including the regulation of cash raffles, prohibiting raffles at annual game nights, establishing a permanent electrical and mechanical amusement devices special fund and providing an appropriation, prohibiting certain electrical or mechanical amusement devices and bona fide contests, and providing for the denial, suspension, and revocation of certain gambling licenses by the department of inspections and appeals, and providing an effective date. Effective 07-01-05, with exception of section 5, effective 05-04-05.",
      "dateSigned": "2005-05-04"
    },
    {
      "billNumber": "HF 683",
      "billTitle": "A bill for an act authorizing the appointment of an attorney to represent an indigent person during a termination of parental rights proceeding or an indigent parole violator, and providing effective and retroactive applicability date provisions.  Effective 05-04-05.",
      "dateSigned": "2005-05-04"
    },
    {
      "billNumber": "HF 708",
      "billTitle": "A bill for an act relating to the establishment of rural improvement zones. Effective 07-01-05.",
      "dateSigned": "2005-05-04"
    },
    {
      "billNumber": "HF 797",
      "billTitle": "A bill for an act relating to the establishment of a promotional program for national historic landmarks and certified cultural and entertainment districts. Effective 07-01-05.",
      "dateSigned": "2005-05-04"
    },
    {
      "billNumber": "HF 840",
      "billTitle": "A bill for an act authorizing the rebate of state sales tax to the owner or operator of a sanctioned automobile racetrack facility.  Effective 07-01-05.",
      "dateSigned": "2005-05-04"
    },
    {
      "billNumber": "SF 78",
      "billTitle": "A bill for an act relating to the exemption from city taxes of land included in an application for voluntary annexation or in a city's involuntary annexation petition and including effective and applicability date provisions.  (FormerlySF 24.)  Effective 5-5-05.",
      "dateSigned": "2005-05-05"
    },
    {
      "billNumber": "SF 350",
      "billTitle": "A bill for an act relating to child support recovery including access to information for the purposes of recovery, provisions relating to failure to withhold income or to pay the amounts withheld, and to the suspension of a child support obligation, the satisfaction of support payments, nullifying related administrative rules and providing penalties.  Effective 7-1-05.",
      "dateSigned": "2005-05-05"
    },
    {
      "billNumber": "SF 395",
      "billTitle": "A bill for an act relating to the activities of the grape and wine development commission, and providing for the transfer of wine gallonage tax revenues to the grape and wine development fund.  (Formerly SFs 276 & 368.) Effective 7-1-05.",
      "dateSigned": "2005-05-05"
    },
    {
      "billNumber": "SF 404",
      "billTitle": "A bill for an act providing for county eligibility for state payment of property tax relief moneys and allowed growth funding for mental health, mental retardation, and developmental disabilities services and providing effective and retroactive applicability dates.  (FormerlySF 399.) Effective 5-5-05.",
      "dateSigned": "2005-05-05"
    },
    {
      "billNumber": "HF 374",
      "billTitle": "A bill for an act relating to veterans by providing for the establishment of a department of veterans affairs, modifying the definition of veteran for property taxation and certain other purposes, providing for the compensation of members of a county commission of veteran affairs, providing for the issuance of combined hunting and fishing licenses to certain veterans, establishing a hepatitis C awareness program for veterans, concerning funds in an account for a state veterans cemetery, concerning military pay differential, and providing an effective date and retroactive and other applicability dates. Effective 05-05-05.",
      "dateSigned": "2005-05-05"
    },
    {
      "billNumber": "HF 438",
      "billTitle": "A bill for an act relating to assessments associated with soil and water conservation districts, by providing for the deposit of moneys in a fund established by a district's commissioners.  Effective 07-01-05.",
      "dateSigned": "2005-05-05"
    },
    {
      "billNumber": "HF 538",
      "billTitle": "A bill for an act revising child welfare requirements involving children with mental health, behavioral, or emotional disorders and providing a contingent effective date. Effective 07-01-05.",
      "dateSigned": "2005-05-05"
    },
    {
      "billNumber": "HF 620",
      "billTitle": "A bill for an act relating to the volunteer health care provider program and providing an effective date. Effective 05-05-05.",
      "dateSigned": "2005-05-05"
    },
    {
      "billNumber": "HF 716",
      "billTitle": "A bill for an act relating to the military division and the homeland security and emergency management division of the department of public defense concerning the activation and use of the civil air patrol, the authority of the adjutant general to enter into interstate agreements for use of national guard personnel, and the use of the national incident management system for state emergencies. Effective 07-01-05.",
      "dateSigned": "2005-05-05"
    },
    {
      "billNumber": "HF 589",
      "billTitle": "A bill for an act relating to the property taxation of nursing facilities and including effective and applicability date provisions. Effective 05-12-05.",
      "dateSigned": "2005-05-12"
    },
    {
      "billNumber": "HF 610",
      "billTitle": "A bill for an act relating to the transmission of electronic mail including the transmission of unsolicited bulk electronic mail, and the sale or offer for direct sale of prescription drugs and the sale of adulterated or misbranded drugs through the use of electronic mail or the internet, and providing for penalties.  Effective 07-01-05.",
      "dateSigned": "2005-05-12"
    },
    {
      "billNumber": "HF 753",
      "billTitle": "A bill for an act requiring certain safety-related information concerning a child to be provided to a parent, guardian, or foster parent or other custodian of a child. Effective 07-01-05.",
      "dateSigned": "2005-05-12"
    },
    {
      "billNumber": "HF 774",
      "billTitle": "A bill for an act relating to the petition and vote requirements for increasing or reducing board of supervisors membership in certain counties. Effective 07-01-05.",
      "dateSigned": "2005-05-12"
    },
    {
      "billNumber": "HF 786",
      "billTitle": "A bill for an act relating to the operating or providing of another business or activity in a health care facility. Effective 07-01-05.",
      "dateSigned": "2005-05-12"
    },
    {
      "billNumber": "HF 801",
      "billTitle": "A bill for an act providing a deduction in computing the individual income tax for certain unreimbursed expenses relating to a human organ transplant and including a retroactive applicability date.  Effective 07-01-05.",
      "dateSigned": "2005-05-12"
    },
    {
      "billNumber": "HF 836",
      "billTitle": "A bill for an act relating to cemeteries and cemetery regulation, providing administration and enforcement procedures, establishing requirements for interment rights agreements and reporting, establishing and appropriating fees, and providing penalties.  Effective 07-01-05.",
      "dateSigned": "2005-05-12"
    },
    {
      "billNumber": "HF 837",
      "billTitle": "A bill for an act relating to state government financial matters concerning charter agencies, the state appeal board, and reinvention initiatives of the department of management, and making appropriations. Effective 07-01-05.",
      "dateSigned": "2005-05-12"
    },
    {
      "billNumber": "HF 841",
      "billTitle": "A bill for an act relating to health care reform, including provisions relating to the medical assistance program, providing appropriations, providing effective dates, and providing for retroactive applicability. Various effective dates and contingency dates. See section 66.",
      "dateSigned": "2005-05-12"
    },
    {
      "billNumber": "HF 857",
      "billTitle": "A bill for an act relating to eligible housing businesses under the enterprise zone program. Effective 07-01-05.",
      "dateSigned": "2005-05-12"
    },
    {
      "billNumber": "HF 870",
      "billTitle": "A bill for an act relating to the applicability of motor vehicle financial responsibility provisions to special mobile equipment and providing an effective date. Effective 05-12-05.",
      "dateSigned": "2005-05-12"
    },
    {
      "billNumber": "SF 272",
      "billTitle": "A bill for an act relating to the council with which the director of human services consults regarding the medical assistance program.  (FormerlySSB 1042.)  Effective 7-1-05.",
      "dateSigned": "2005-05-16"
    },
    {
      "billNumber": "SF 343",
      "billTitle": "A bill for an act relating to governmental services involving audit reports, child abuse reporting and registry requirements, and the family investment program.  Effective 7-1-05.",
      "dateSigned": "2005-05-16"
    },
    {
      "billNumber": "HF 685",
      "billTitle": "A bill for an act establishing the child identification and protection Act, which prohibits the fingerprinting of children, and providing for exceptions. Effective 07-01-05.",
      "dateSigned": "2005-05-20"
    },
    {
      "billNumber": "HF 718",
      "billTitle": "A bill for an act allowing a refund of unexpired motor vehicle registration fees to a vehicle owner who moves out of state.  Effective 07-01-05.",
      "dateSigned": "2005-05-20"
    },
    {
      "billNumber": "HF 856",
      "billTitle": "A bill for an act providing a sales and use tax exemption for certain nonprofit organizations that build or repair low-income dwellings. Effective 07-01-05.",
      "dateSigned": "2005-05-20"
    },
    {
      "billNumber": "HF 859",
      "billTitle": "A bill for an act relating to the establishment of a form of business association referred to as a cooperative, and providing for fees and tax credits, providing penalties, and providing an effective date. Effective 07-01-05, with exception of section 118, effective 01-01-06.",
      "dateSigned": "2005-05-20"
    },
    {
      "billNumber": "HF 805",
      "billTitle": "A bill for an act relating to agricultural production including animal feeding operations, by providing for the regulation of open feedlot operations, and agricultural production liens, and providing for penalties. Effective 07-01-05.",
      "dateSigned": "2005-05-23"
    },
    {
      "billNumber": "HF 828",
      "billTitle": "A bill for an act relating to aquatic regulations and activities, including aquatic invasive species, the regulation and registration of certain vessels, the operation of certain vessels by minors, inspections of certain vessels, the operation of vessels for hire or commercial vessels, providing for penalties, and appropriating the moneys collected from certain registration fee increases to the state fish and game protection fund. Effective 07-01-05.",
      "dateSigned": "2005-05-23"
    },
    {
      "billNumber": "HF 879",
      "billTitle": "A bill for an act relating to the regulation of snowmobiles and establishing fees. Effective 07-01-05.",
      "dateSigned": "2005-05-23"
    },
    {
      "billNumber": "SF 206",
      "billTitle": "A bill for an act relating to deer population management and providing penalties and appropriations.  (FormerlySSB 1147.) Effective 7-1-05.",
      "dateSigned": "2005-06-03"
    },
    {
      "billNumber": "SF 342",
      "billTitle": "A bill for an act relating to appropriation matters by making and increasing appropriations for the fiscal year beginning July 1, 2004, and providing effective and applicability date provisions.  (FormerlySSB 1266.)  Various effective dates; see sections 23 and 24 of bill.",
      "dateSigned": "2005-06-03"
    },
    {
      "billNumber": "SF 413",
      "billTitle": "A bill for an act relating to sales and use tax changes, excise taxes on rental of rooms and sleeping quarters, and the sale and use of construction equipment, and relating to the policy and administration of other taxes and tax-related matters, and including effective and retroactive applicability date provisions.  Various effective dates; see sections 16 and 73 of bill.",
      "dateSigned": "2005-06-03"
    },
    {
      "billNumber": "HF 440",
      "billTitle": "A bill for an act relating to sanctioning the motor vehicle operating privileges of a person upon a second or subsequent conviction for motor fuel theft from a retail dealer. Effective 07-01-05.",
      "dateSigned": "2005-06-03"
    },
    {
      "billNumber": "HF 674",
      "billTitle": "A bill for an act relating to distribution of secondary and farm-to-market road funds. Effective 07-01-05.",
      "dateSigned": "2005-06-03"
    },
    {
      "billNumber": "HF 682",
      "billTitle": "A bill for an act relating to the assessment of a civil penalty and criminal penalty surcharge, and creating a criminalistics laboratory fund. Effective 07-01-05.",
      "dateSigned": "2005-06-03"
    },
    {
      "billNumber": "HF 739",
      "billTitle": "A bill for an act relating to education technology, including the creation of an Iowa learning technology commission and pilot programs, and the establishment of a research triangle and clearinghouse, and providing for contingent effectiveness.  Effective 07-01-05, with exception of sections 3-6 effective contingent on general assembly appropriation.",
      "dateSigned": "2005-06-03"
    },
    {
      "billNumber": "SF 176",
      "billTitle": "A bill for an act entering Iowa into the midwestern higher education compact.  (FormerlySF 168.)  Effective 7-1-05.",
      "dateSigned": "2005-06-06"
    },
    {
      "billNumber": "SF 389",
      "billTitle": "A bill for an act providing individual and corporate income tax credits for soy-based cutting tool oil and including an applicability date provision. (FormerlySSB 1177.)  Effective 7-1-05.",
      "dateSigned": "2005-06-06"
    },
    {
      "billNumber": "HF 742",
      "billTitle": "A bill for an act relating to the Iowa early intervention block grant program by changing the reporting requirements, extending the repeal of the chapter establishing the program, and providing an effective date. Effective 07-01-05, with exception of section 2 effective 06-06-05.",
      "dateSigned": "2005-06-06"
    },
    {
      "billNumber": "HF 761",
      "billTitle": "A bill for an act relating to improvement of the early care, child care services, education, health, and human services systems, revising the child and dependent care tax credit, creating an early childhood development tax credit, and providing an applicability date. Effective 07-01-05.",
      "dateSigned": "2005-06-06"
    },
    {
      "billNumber": "HF 816",
      "billTitle": "A bill for an act relating to the funding of, the operation of, and appropriation of moneys to the college student aid commission, the department for the blind, the department of cultural affairs, the department of education, and the state board of regents and providing an effective date. Effective 07-01-05, with exception of section 22 effective 06-06-05.",
      "dateSigned": "2005-06-06"
    },
    {
      "billNumber": "SF 245",
      "billTitle": "A bill for an act relating to a secondary school core curriculum, including requiring the state board of education to determine a model core curriculum and set a statewide core curriculum completion rate goal, requiring school districts to develop a core curriculum plan for eighth grade students and to report student core curriculum progress annually, requiring school districts and schools to report core curriculum completion percentages annually, and providing for the coordination of an educational data definitions working group.  (FormerlySF 46.)  Effective 7-1-05.",
      "dateSigned": "2005-06-07"
    },
    {
      "billNumber": "HF 809",
      "billTitle": "A bill for an act relating to and making appropriations to the department of economic development, the office of the treasurer of state, certain board of regents institutions, the department of workforce development, and the public employment relations board, related matters, and providing an effective date. Effective 07-01-05, with exception of of section 21 effective 06-09-05.",
      "dateSigned": "2005-06-09"
    },
    {
      "billNumber": "HF 868",
      "billTitle": "A bill for an act relating to economic development, business, workforce, and regulatory assistance and tax credits, property tax assessment, to excise taxes on E-85 gasoline, to issuance of revenue bonds, and to state developmental, research, and regulatory oversight, and including effective date and retroactive applicability provisions. Effective 07-01-05, with exception of sections 55-59 and division XII effective 06-09-05 and sections 83-84 effective 01-01-06.",
      "dateSigned": "2005-06-09"
    },
    {
      "billNumber": "SF 201",
      "billTitle": "A bill for an act providing for veterinary emergency preparedness and response by the department of agriculture and land stewardship.  Effective 7-1-05.",
      "dateSigned": "2005-06-10"
    },
    {
      "billNumber": "HF 222",
      "billTitle": "A bill for an act relating to the nonpartisan election of township officers. Effective 07-01-05.",
      "dateSigned": "2005-06-10"
    },
    {
      "billNumber": "HF 821",
      "billTitle": "A bill for an act relating to the establishment of a prescription drug assistance clearinghouse program by the commissioner of insurance, and providing for a contingent appropriation. Effective 07-01-05.",
      "dateSigned": "2005-06-10"
    },
    {
      "billNumber": "HF 834",
      "billTitle": "A bill for an act relating to persons commercially cleaning toilet units and private sewage disposal facilities by providing regulations, fees, and civil penalties, and making appropriations.  Effective 07-01-05.",
      "dateSigned": "2005-06-10"
    },
    {
      "billNumber": "HF 858",
      "billTitle": "A bill for an act establishing a statewide work-based learning intermediary network program and creating a fund. Effective 07-01-05.",
      "dateSigned": "2005-06-10"
    },
    {
      "billNumber": "HF 883",
      "billTitle": "A bill for an act to legalize actions taken and proceedings conducted by the state of Iowa, Linn county, the city of Cedar Rapids, and three school districts including the Cedar Rapids community school district, the College community school district, and the Linn-Mar community school district, which relate to erroneously established boundaries, and providing an effective date. Effective 06-10-05.",
      "dateSigned": "2005-06-10"
    },
    {
      "billNumber": "HF 831",
      "billTitle": "A bill for an act relating to tax credits for equity investments in qualifying businesses or community-based seed capital funds.  Effective 07-01-05.",
      "dateSigned": "2005-06-13"
    },
    {
      "billNumber": "HF 619",
      "billTitle": "A bill for an act relating to criminal sentencing, victim notification, and the sex offender registry, by establishing a special sentence for certain offenders, requiring DNA testing of certain offenders and lengthening the time an information or indictment may be found in certain offenses where DNA evidence is available, requiring sex offender treatment in order to accumulate earned time, restricting certain persons from residing with sex offenders, establishing a sex offender treatment and supervision task force, providing penalties, and providing effective dates.  Effective 07-01-05, with exception of Division I effective 06-14-05.",
      "dateSigned": "2005-06-14"
    },
    {
      "billNumber": "HF 807",
      "billTitle": "A bill for an act relating to and making appropriations to the judicial branch, and providing an effective date. Effective 07-01-05, with exception of section 2 effective 06-14-05.",
      "dateSigned": "2005-06-14"
    },
    {
      "billNumber": "HF 808",
      "billTitle": "A bill for an act relating to and making appropriations involving state government, including provisions affecting agriculture and natural resources, and provisions relating to a wind energy production tax credit, and providing for fees. Effective 07-01-05.",
      "dateSigned": "2005-06-14"
    },
    {
      "billNumber": "HF 810",
      "billTitle": "A bill for an act relating to and making appropriations to certain state departments, agencies, funds, and certain other entities, providing for regulatory authority, and other properly related matters, and providing an effective date. Effective 07-01-05, with exception of sections 23-26 effective 06-14-05.",
      "dateSigned": "2005-06-14"
    },
    {
      "billNumber": "HF 811",
      "billTitle": "A bill for an act relating to and making appropriations to the justice system, revising pretrial release requirements for certain criminal offenses, and providing an effective date. Effective 07-01-05, with exception of division II and III effective 06-14-05.",
      "dateSigned": "2005-06-14"
    },
    {
      "billNumber": "HF 825",
      "billTitle": "A bill for an act relating to and making appropriations to the department of human services, the department of elder affairs, the Iowa department of public health, the commission of veterans affairs and the Iowa veterans home, and the department of inspections and appeals, providing for fee increases, and including other related provisions and appropriations, and providing effective dates. Effective 07-01-05, with exception of section 16.ss.  3a, 3b, 10a; sections 30, 32-36, 44, 50, 54 and 82 effective 06-14-05.",
      "dateSigned": "2005-06-14"
    },
    {
      "billNumber": "HF 862",
      "billTitle": "A bill for an act relating to and making appropriations from the healthy Iowans tobacco trust and the tobacco settlement trust fund.  Effective 07-01-05.",
      "dateSigned": "2005-06-14"
    },
    {
      "billNumber": "HF 881",
      "billTitle": "A bill for an act relating to the compensation and benefits for public officials and employees and members of the general assembly, providing for related matters, making appropriations, and including effective and retroactive applicability date provisions. Effective 07-01-05, with exception fo section 13 effective 06-14-05 and section 14 effective 01-08-07.",
      "dateSigned": "2005-06-14"
    },
    {
      "billNumber": "SF 200",
      "billTitle": "A bill for an act relating to the administration of the department of agriculture and land stewardship, by providing for its powers and duties. (FormerlySSB 1111.)  Effective 7-1-05.",
      "dateSigned": "2005-06-15"
    },
    {
      "billNumber": "SF 390",
      "billTitle": "A bill for an act relating to the generation and purchase of renewable energy including establishing a renewable energy tax credit program administered by the utilities division of the department of commerce and the department of revenue, and providing an effective date.  (FormerlySSB 1187&SF 371.)  Effective 6-15-05.",
      "dateSigned": "2005-06-15"
    },
    {
      "billNumber": "HF 875",
      "billTitle": "A bill for an act relating to and making appropriations to state departments and agencies from the rebuild Iowa infrastructure fund, environment first fund, tobacco settlement trust fund, vertical infrastructure fund, general fund of the state, and related matters, and creating the honey creek premier destination park bond program and authority and providing for the issuance of tax-exempt bonds, and including effective and retroactive applicability date provisions. Effective 07-01-05, with exception of sections 7, 22-24, 35 and Division X effective 06-15-05.",
      "dateSigned": "2005-06-15"
    },
    {
      "billNumber": "HF 882",
      "billTitle": "A bill for an act relating to state and local finances by providing for tax exemptions, credits, tax credit transfers, and other tax-related matters and by making, reducing, and transferring appropriations, providing for fees, providing for wind energy production tax credits, and providing for properly related matters and penalties and including effective and retroactive applicability date provisions. Effective 07-01-05, with exception of sections 4, 16, 21, 58, 67, 76, 79 and Division VII effective 06-16-05 and section 144 effective 07-01-06.",
      "dateSigned": "2005-06-16"
    }
  ]
}