{
  "year": 2012,
  "totalBills": 138,
  "bills": [
    {
      "billNumber": "SF 2007",
      "billTitle": "A bill for an act making an appropriation to the college student aid commission for purposes of the national guard educational assistance program and including effective date provisions.  Effective 1-31-12.",
      "dateSigned": "2012-01-31"
    },
    {
      "billNumber": "SF 2018",
      "billTitle": "A bill for an act relating to financial assistance for purposes of the battleship Iowa, BB-61, making appropriations, and including effective date provisions.  (FormerlySSB 3008.)  Effective 2-1-12.",
      "dateSigned": "2012-02-01"
    },
    {
      "billNumber": "SF 93",
      "billTitle": "A bill for an act enhancing the penalty for certain domestic abuse assault cases and providing a penalty.  (FormerlySSB 1011.) Effective 7-1-12.",
      "dateSigned": "2012-02-15"
    },
    {
      "billNumber": "SF 2086",
      "billTitle": "A bill for an act relating to regular inspections of state-licensed health care facilities and including effective date and retroactive applicability provisions.  (FormerlySSB 3036.)  Effective 2-22-12.",
      "dateSigned": "2012-02-22"
    },
    {
      "billNumber": "SF 2120",
      "billTitle": "A bill for an act relating to the practice of optometry.  (FormerlySSB 3057.)  Effective 7-1-12.",
      "dateSigned": "2012-02-22"
    },
    {
      "billNumber": "HF 589",
      "billTitle": "A bill for an act relating to an offense involving agricultural operations, and providing penalties, and including effective date provisions. Effective 3-2-12.",
      "dateSigned": "2012-03-02"
    },
    {
      "billNumber": "SF 2170",
      "billTitle": "A bill for an act relating to service of notice requirements for holders of a property tax sale certificate of purchase.  (FormerlySSB 3098.) Effective 7-1-12.",
      "dateSigned": "2012-03-07"
    },
    {
      "billNumber": "HF 2150",
      "billTitle": "A bill for an act updating the Code references to the Internal Revenue Code, and including effective date and retroactive applicability provisions. Effective 3-7-12.",
      "dateSigned": "2012-03-07"
    },
    {
      "billNumber": "HF 2165",
      "billTitle": "A bill for an act relating to physician orders for scope of treatment. Effective 7-1-12.",
      "dateSigned": "2012-03-07"
    },
    {
      "billNumber": "SF 2127",
      "billTitle": "A bill for an act relating to matters under the purview and authority of the professional licensing and regulation bureau of the banking division of the department of commerce.  (FormerlySSB 3067.)  Effective 7-1-12.",
      "dateSigned": "2012-03-08"
    },
    {
      "billNumber": "SF 2058",
      "billTitle": "A bill for an act relating to certain records of rural water districts, city utilities, and city enterprises.  Effective 7-1-12.",
      "dateSigned": "2012-03-14"
    },
    {
      "billNumber": "SF 2092",
      "billTitle": "A bill for an act relating to informal dispute resolution, by eliminating a program for the establishment and support of locally organized informal dispute resolution centers in the office of prosecuting attorneys training coordinator of the department of justice.  (FormerlySSB 3073.)  Effective 7-1-12.",
      "dateSigned": "2012-03-14"
    },
    {
      "billNumber": "SF 2244",
      "billTitle": "A bill for an act requiring that a veteran be seriously injured or very seriously injured in order to be eligible to receive a grant under the injured veterans grant program.  (FormerlySSB 3157.) Effective 7-1-12.",
      "dateSigned": "2012-03-14"
    },
    {
      "billNumber": "SF 2282",
      "billTitle": "A bill for an act concerning the definitions of \"all-terrain vehicle\" and \"off-road utility vehicle\" for purposes of provisions administered by the department of natural resources.  (FormerlySSB 3001.)  Effective 7-1-12.",
      "dateSigned": "2012-03-14"
    },
    {
      "billNumber": "SF 2292",
      "billTitle": "A bill for an act to legalize the proceedings of the City Council of Ankeny, Iowa, including all legal notices given, in connection with the making of a contract for the construction of certain improvements to the NE 7th Street Sanitary Sewer Improvement Project with Pirc-Tobin Construction, Inc. of Alburnett, Iowa, in connection with, and to legalize said contract, and authorize its performance by said Council and the financing including project notes issued thereof.  (FormerlySSB 3180.)  Effective 3-14-12.",
      "dateSigned": "2012-03-14"
    },
    {
      "billNumber": "SF 2218",
      "billTitle": "A bill for an act relating to school bus safety, including providing penalties for failure to obey school bus warning lamps and stop signal arms, providing for a school bus safety study and administrative remedies, and making an appropriation.  (FormerlySF 2021.)  Effective 3-16-12.",
      "dateSigned": "2012-03-16"
    },
    {
      "billNumber": "SF 2146",
      "billTitle": "A bill for an act relating to meeting requirements for rural water districts.  (FormerlySSB 3070.)  Effective 7-1-12.",
      "dateSigned": "2012-03-22"
    },
    {
      "billNumber": "SF 2202",
      "billTitle": "A bill for an act relating to matters under the purview of the banking division of the department of commerce, and including effective date provisions.  (FormerlySSB 3125.)  Various effective dates; see sections 18 and 28 of bill.",
      "dateSigned": "2012-03-22"
    },
    {
      "billNumber": "SF 2212",
      "billTitle": "A bill for an act relating to economic development by making technical and policy changes related to environmental response projects and to certain programs administered by the economic development authority and including retroactive applicability provisions.  (FormerlySSB 3072.)  Effective 7-1-12.",
      "dateSigned": "2012-03-22"
    },
    {
      "billNumber": "SF 2247",
      "billTitle": "A bill for an act relating to terminology changes in Iowa Code references to mental retardation.  (FormerlySSB 3136.)  Effective 7-1-12.",
      "dateSigned": "2012-03-22"
    },
    {
      "billNumber": "SF 2279",
      "billTitle": "A bill for an act relating to credit unions, including methods of voting by credit union members and the board of directors, electronic communications to certain credit union members, the composition of the board of directors, assessment of fees for examination and supervision, limited negotiated disclosures of certain confidential information, treatment of ownership shares, superintendent management authority, individual development accounts held at credit unions and other financial institutions, and making penalties applicable.  (FormerlySSB 3124.)  Effective 7-1-12.",
      "dateSigned": "2012-03-22"
    },
    {
      "billNumber": "SF 2285",
      "billTitle": "A bill for an act relating to statutory corrections which may adjust language to reflect current practices, insert earlier omissions, delete redundancies and inaccuracies, delete temporary language, resolve inconsistencies and conflicts, update ongoing provisions, or remove ambiguities, and including effective date and retroactive applicability provisions.  (FormerlySSB 3153.) Various effective dates; see sections 141 and 142 of bill.",
      "dateSigned": "2012-03-22"
    },
    {
      "billNumber": "HF 2368",
      "billTitle": "A bill for an act providing for the issuance of a certificate of birth resulting in stillbirth, providing for a fee, and including effective date provisions. Effective 3-26-12.",
      "dateSigned": "2012-03-26"
    },
    {
      "billNumber": "SF 2203",
      "billTitle": "A bill for an act relating to nonsubstantive Code corrections and including effective date provisions.  (FormerlySSB 3134.)  Various effective dates; see section 158 of bill.",
      "dateSigned": "2012-03-29"
    },
    {
      "billNumber": "HF 2101",
      "billTitle": "A bill for an act relating to preparation and recording of public land survey corner certificates. Effective 7-1-12.",
      "dateSigned": "2012-03-29"
    },
    {
      "billNumber": "HF 2145",
      "billTitle": "A bill for an act establishing regulations to permit access to surplus lines insurance in this state, and providing civil and criminal penalties, coordinating provisions, and repeals, and including effective date provisions. Effective 3-29-12.",
      "dateSigned": "2012-03-29"
    },
    {
      "billNumber": "HF 2285",
      "billTitle": "A bill for an act relating to the definition of hydronic for purposes of the Iowa plumber, mechanical professional, and contractor licensing Act and including effective date provisions. Effective 3-29-12.",
      "dateSigned": "2012-03-29"
    },
    {
      "billNumber": "HF 2301",
      "billTitle": "A bill for an act requiring advance notification to utilities by specified owners of alternate energy production facilities of construction or installation of the facility. Effective 7-1-12.",
      "dateSigned": "2012-03-29"
    },
    {
      "billNumber": "HF 2320",
      "billTitle": "A bill for an act relating to the designation of area agencies on aging, and including effective date provisions. Effective 3-29-12.",
      "dateSigned": "2012-03-29"
    },
    {
      "billNumber": "HF 2402",
      "billTitle": "A bill for an act permitting the temporary allocation and use of moneys in the veterans trust fund for cemetery grant development purposes. Effective 7-1-12.",
      "dateSigned": "2012-03-29"
    },
    {
      "billNumber": "SF 2096",
      "billTitle": "A bill for an act relating to reimbursements for certain state prisoners confined in a county jail.  (FormerlySSB 3024.) Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2122",
      "billTitle": "A bill for an act exempting review services from specified requirements otherwise applicable to the performance of attest services by out-of-state certified public accounting firms.  (FormerlySSB 3019.)  Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2153",
      "billTitle": "A bill for an act increasing the size of the commercial and industrial highway network.  (FormerlySSB 3115.)  Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2159",
      "billTitle": "A bill for an act relating to child support enforcement including protection of child support information.  (FormerlySSB 3082.) Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2160",
      "billTitle": "A bill for an act relating to allowing financial supplementation to a nursing facility for provision of a private room to a recipient of medical assistance.  (FormerlySSB 3054.)  Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2163",
      "billTitle": "A bill for an act relating to an exception from state certification for adult day services programs.  (FormerlySSB 3037.)  Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2172",
      "billTitle": "A bill for an act relating to management of swine, including by providing for biosecurity and development in a farrowing and gestating operation which is part of a confinement feeding operation, and making penalties applicable. (FormerlySF 2022.) Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2185",
      "billTitle": "A bill for an act relating to the supervision of physician assistants. (FormerlySSB 3053.)  Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2186",
      "billTitle": "A bill for an act relating to medical assistance eligibility for inmates of public institutions.  (FormerlySSB 3084.)  Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2188",
      "billTitle": "A bill for an act relating to the renewal period for foster care licensing. (FormerlySSB 3080.)  Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2225",
      "billTitle": "A bill for an act relating to child abuse by prohibiting retaliation for reporting, providing for implementation of reporting policies at postsecondary institutions, requiring review of training requirements, and providing a remedy.  (FormerlySF 2035.)  Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2248",
      "billTitle": "A bill for an act relating to the licensed professionals authorized to prescribe respiratory care services.  (FormerlySSB 3040.) Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2269",
      "billTitle": "A bill for an act relating to the land application of wastewater from on-farm processing operations, and including effective date provisions. (FormerlySF 2152.)  Effective 3-30-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2280",
      "billTitle": "A bill for an act relating to boiler inspections.  (FormerlySSB 3158.) Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2288",
      "billTitle": "A bill for an act relating to requirements for drivers of vehicles at railroad grade crossings upon the approach or presence of railroad track equipment, and making a penalty applicable.  (FormerlySF 2093.)  Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2294",
      "billTitle": "A bill for an act relating to the authorized activities of auctioneers in conducting a public sale or auction of real estate, and providing penalty provisions.  (FormerlySSB 3064.)  Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2296",
      "billTitle": "A bill for an act relating to the criminal offense of solicitation to commit murder and providing a penalty.  (FormerlySSB 3154.) Effective 7-1-12.",
      "dateSigned": "2012-03-30"
    },
    {
      "billNumber": "SF 2221",
      "billTitle": "A bill for an act requiring background checks for school bus drivers and making penalties applicable.  (FormerlySSB 3003.) Effective 7-1-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "SF 2249",
      "billTitle": "A bill for an act relating to motor vehicle dealer activities at fair events, vehicle shows, vehicle exhibitions, and motorcycle rallies and to the definition of travel trailer for purposes of travel trailer dealer requirements, and including effective date provisions.  (FormerlySSB 3165.) Effective 4-4-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "SF 2260",
      "billTitle": "A bill for an act revising the Iowa nonprofit corporation Act.  (FormerlySSB 3126.)  Effective 7-1-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "SF 2265",
      "billTitle": "A bill for an act providing for notarial acts, providing for fees, and including effective date provisions.  (FormerlySSB 3133.) Effective 1-1-13.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "SF 2314",
      "billTitle": "A bill for an act relating to transportation and other infrastructure-related appropriations to the department of transportation, including allocation and use of moneys from the road use tax fund and the primary road fund.  (FormerlySSB 3175.) Effective 7-1-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "SF 2324",
      "billTitle": "A bill for an act making appropriations to the department of workforce development for certain purposes and including effective date and retroactive applicability provisions.  (FormerlySSB 3198.)  Effective 4-4-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "HF 2168",
      "billTitle": "A bill for an act relating to the authorized deposit of public funds. Effective 7-1-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "HF 2321",
      "billTitle": "A bill for an act amending provisions in the uniform commercial code relating to secured transactions, and including effective date provisions. Effective 7-1-13.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "HF 2370",
      "billTitle": "A bill for an act relating to civil actions relating to real estate, including mortgage foreclosure actions. Effective 7-1-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "HF 2379",
      "billTitle": "A bill for an act relating to expunging certain criminal records, and including applicability provisions. Effective 7-1-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "HF 2383",
      "billTitle": "A bill for an act relating to mandatory reporting of school employee misconduct to the board of educational examiners. Effective 7-1-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "HF 2387",
      "billTitle": "A bill for an act relating to improvements to and implementation of laws concerning elder abuse. Effective 7-1-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "HF 2390",
      "billTitle": "A bill for an act relating to obscene material, commercial sexual activity, and human trafficking, and providing penalties and making penalties applicable. Effective 7-1-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "HF 2403",
      "billTitle": "A bill for an act relating to requirements for a commercial driver's license for certain persons transitioning from military service. Effective 7-1-12.",
      "dateSigned": "2012-04-04"
    },
    {
      "billNumber": "HF 2092",
      "billTitle": "A bill for an act providing for the year-round operation of farmers markets, and including effective date provisions. Effective 4-5-12.",
      "dateSigned": "2012-04-05"
    },
    {
      "billNumber": "HF 2144",
      "billTitle": "A bill for an act relating to permissible forms of ownership of transmission facilities subject to a joint agreement for generating, purchasing, or otherwise acquiring electric power and energy. Effective 7-1-12.",
      "dateSigned": "2012-04-05"
    },
    {
      "billNumber": "HF 2166",
      "billTitle": "A bill for an act relating to the administration of the streamlined sales tax agreement by the department of revenue. Effective 7-1-12.",
      "dateSigned": "2012-04-05"
    },
    {
      "billNumber": "HF 2264",
      "billTitle": "A bill for an act relating to interment rights of certain veterans and their spouses in cemeteries owned and controlled by governmental subdivisions. Effective 7-1-12.",
      "dateSigned": "2012-04-05"
    },
    {
      "billNumber": "HF 2306",
      "billTitle": "A bill for an act relating to the membership of the medical assistance advisory council. Effective 7-1-12.",
      "dateSigned": "2012-04-05"
    },
    {
      "billNumber": "HF 2369",
      "billTitle": "A bill for an act relating to vital statistics, including the issuance of a burial transit permit and the transmission and recording of certain death certificates, and including effective date provisions. Effective 7-1-12, with exception of section 1 effective 4-5-12.",
      "dateSigned": "2012-04-05"
    },
    {
      "billNumber": "HF 2404",
      "billTitle": "A bill for an act relating to the extension of the effective date of a driver's license for a person serving on active duty in military service. Effective 7-1-12.",
      "dateSigned": "2012-04-05"
    },
    {
      "billNumber": "SF 2038",
      "billTitle": "A bill for an act relating to the duties and requirements of the department of veterans affairs and the commission of veterans affairs.  (FormerlySSB 3010.)  Effective 7-1-12.",
      "dateSigned": "2012-04-09"
    },
    {
      "billNumber": "SF 2137",
      "billTitle": "A bill for an act relating to certain property taxes for joint county-city buildings and including applicability provisions.  Effective 7-1-12.",
      "dateSigned": "2012-04-09"
    },
    {
      "billNumber": "SF 2165",
      "billTitle": "A bill for an act relating to the documentation required to prepare a notice of alleged paternity and support debt in administrative paternity proceedings.  (FormerlySSB 3083.)  Effective 7-1-12.",
      "dateSigned": "2012-04-09"
    },
    {
      "billNumber": "SF 2220",
      "billTitle": "A bill for an act relating to the licensing of schools of cosmetology arts and sciences and barber schools.  (FormerlySF 2044.)  Effective 7-1-12.",
      "dateSigned": "2012-04-09"
    },
    {
      "billNumber": "SF 2231",
      "billTitle": "A bill for an act relating to the practices and procedures of the state public defender.  (FormerlySSB 3061.)  Effective 7-1-12.",
      "dateSigned": "2012-04-09"
    },
    {
      "billNumber": "SF 413",
      "billTitle": "A bill for an act relating to financial responsibilities of local emergency management commissions.  (FormerlySSB 1156.)  Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "SF 2097",
      "billTitle": "A bill for an act relating to the department of public defense by making changes regarding the Iowa military code and military service, including terminology modifications and leases entered into by the department of public defense and the armory board, and including effective date provisions.  (FormerlySSB 3081.)  Various effective dates; see section 43 of bill.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "SF 2126",
      "billTitle": "A bill for an act providing for the funding of the duties of the state's social security administrator.  (FormerlySSB 3016.) Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "SF 2164",
      "billTitle": "A bill for an act relating to department of human services' evaluations of criminal or abuse records of employees of health care facilities and child care facilities and homes.  (FormerlySSB 3111.)  Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "SF 2208",
      "billTitle": "A bill for an act relating to the confidentiality of an arrest warrant. (FormerlySSB 3026.)  Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "SF 2245",
      "billTitle": "A bill for an act requiring a study and report on the establishment of a dual diagnosis treatment program for posttraumatic stress at the Iowa veterans home.  (FormerlySSB 3150.)  Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "SF 2267",
      "billTitle": "A bill for an act concerning oversight of schools offering postsecondary educational programs by the college student aid commission and making penalties applicable.  (FormerlySSB 3167.) Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "SF 2289",
      "billTitle": "A bill for an act relating to the Iowa disaster aid individual assistance grant program administered by the department of human services.  (FormerlySF 2180.)  Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "SF 2312",
      "billTitle": "A bill for an act relating to persons with mental health illnesses and substance-related disorders.  (FormerlySSB 3137.)  Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "SF 2318",
      "billTitle": "A bill for an act relating to the Iowa health information network, providing for fees, and including effective date provisions.  (FormerlySSB 3056andSF 2166.)  Effective 4-12-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "HF 524",
      "billTitle": "A bill for an act relating to the administration of the special appraiser's fund and the assessment expense fund. Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "HF 2226",
      "billTitle": "A bill for an act relating to child abuse reports and disposition data. Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "HF 2228",
      "billTitle": "A bill for an act relating to requirements for a motor vehicle operator to have control of the vehicle at all times and to change lanes or reduce speed in specific situations, and providing penalties. Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "HF 2231",
      "billTitle": "A bill for an act relating to residency qualifications for memorial hospital commissioners. Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "HF 2292",
      "billTitle": "A bill for an act relating to confinement feeding operations confining fish, and making penalties applicable. Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "HF 2305",
      "billTitle": "A bill for an act relating to the powers and duties of the department on aging. Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "HF 2323",
      "billTitle": "A bill for an act relating to city utilities and city enterprises by making changes to requirements related to residential rental property. Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "HF 2388",
      "billTitle": "A bill for an act relating to maximizing hospital-specific disproportionate share hospital payments, and providing for contingent implementation. Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "HF 2427",
      "billTitle": "A bill for an act relating to electrical and mechanical amusement devices concerning liability for device distributors and penalties for awarding cash prizes for the use of, or for failing to include a security mechanism on, electrical or mechanical amusement devices. Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "HF 2428",
      "billTitle": "A bill for an act relating to the movement of certain combinations of vehicles on economic export corridors established by the department of transportation. Effective 7-1-12.",
      "dateSigned": "2012-04-12"
    },
    {
      "billNumber": "SF 2112",
      "billTitle": "A bill for an act relating to transportation, including by providing for the registration and titling of military vehicles and allowing a veteran to request that the veteran's driver's license or nonoperator's identification card be marked with the word \"VETERAN\" to indicate veteran status and allowing the commission of veterans affairs to allocate certain funds. (FormerlySF 2037).  Effective 7-1-12.",
      "dateSigned": "2012-04-19"
    },
    {
      "billNumber": "SF 2158",
      "billTitle": "A bill for an act relating to reimbursement of speech pathology services under the medical assistance program.  (FormerlySF 2082.) Effective 7-1-12.",
      "dateSigned": "2012-04-19"
    },
    {
      "billNumber": "SF 2216",
      "billTitle": "A bill for an act relating to apportioned registration of commercial motor vehicles under the international registration plan, and including implementation provisions.  (FormerlySSB 3120.)  Effective 7-1-12.",
      "dateSigned": "2012-04-19"
    },
    {
      "billNumber": "SF 2217",
      "billTitle": "A bill for an act relating to flood mitigation by establishing a flood mitigation program, establishing a flood mitigation board, authorizing the use of certain sales tax revenue and other financial assistance for flood mitigation projects, establishing a flood mitigation fund, authorizing the issuance of bonds for certain flood mitigation projects, providing for appropriations, and including effective date provisions.  (FormerlySSB 3130.) Effective 4-19-12.",
      "dateSigned": "2012-04-19"
    },
    {
      "billNumber": "SF 2311",
      "billTitle": "A bill for an act revising provisions affecting the administration of the department of agriculture and land stewardship, including associated regulations and licensing, as it relates to biofuels, weather and market information, internet publications, soil and water conservation, feed, vaccinations, tuberculosis, brucellosis, classical swine fever, Johne's disease, treatment for sheep, branding, manufactured articles, grain, pesticides, coal mining, and weights and measures, making penalties applicable, and including applicability provisions.  (FormerlySSB 3140.) Effective 7-1-12.",
      "dateSigned": "2012-04-19"
    },
    {
      "billNumber": "SF 2317",
      "billTitle": "A bill for an act relating to the issuance of hunting, fur dealer, fur harvester, and fishing licenses, providing for fees, and including effective date provisions.  (FormerlySSB 3051andSF 2167.)  Effective 1-1-13.",
      "dateSigned": "2012-04-19"
    },
    {
      "billNumber": "SF 2325",
      "billTitle": "A bill for an act relating to the income tax checkoffs for the child abuse prevention program fund and the veterans trust fund and volunteer fire fighter preparedness fund, and including retroactive applicability provisions.  (FormerlySSB 3196.)  Effective 7-1-12.",
      "dateSigned": "2012-04-19"
    },
    {
      "billNumber": "SF 2329",
      "billTitle": "A bill for an act relating to the rebate of state sales tax to the owner or operator of a baseball and softball tournament facility and movie site. (FormerlySF 2110andSF 2168.)  Effective 7-1-12.",
      "dateSigned": "2012-04-19"
    },
    {
      "billNumber": "HF 2399",
      "billTitle": "A bill for an act relating to scrap metal transactions, prohibiting certain sales, and providing penalties. Effective 7-1-12.",
      "dateSigned": "2012-04-19"
    },
    {
      "billNumber": "HF 2467",
      "billTitle": "A bill for an act relating to the regulation of snowmobiles, all-terrain vehicles, and watercraft by the department of natural resources, establishing fees, and making penalties applicable.  Effective 7-1-12.",
      "dateSigned": "2012-04-19"
    },
    {
      "billNumber": "SF 364",
      "billTitle": "A bill for an act relating to the licensure and regulation of persons offering occupational therapy services, and orthotists, prosthetists, and pedorthists, providing exceptions for persons practicing within the scope of their professions, and providing for fees and penalties.  (FormerlySF 226.) Effective 7-1-12.",
      "dateSigned": "2012-04-27"
    },
    {
      "billNumber": "SF 451",
      "billTitle": "A bill for an act relating to the allowable uses for modified allowable growth for programs for returning dropouts and dropout prevention and including applicability provisions.  (FormerlySF 247.)  Effective 7-1-12.",
      "dateSigned": "2012-04-27"
    },
    {
      "billNumber": "SF 2322",
      "billTitle": "A bill for an act providing volunteer fire fighters and emergency medical services personnel with an individual income tax credit and including effective date and applicability provisions.  (FormerlySSB 3195.) Effective 1-1-13.",
      "dateSigned": "2012-04-27"
    },
    {
      "billNumber": "SF 2333",
      "billTitle": "A bill for an act providing a sales tax exemption for the sale of tangible personal property or services to substance abuse treatment or prevention programs that receive block grant funding from the Iowa department of public health.  (FormerlySSB 3185.)  Effective 7-1-12.",
      "dateSigned": "2012-04-27"
    },
    {
      "billNumber": "HF 675",
      "billTitle": "A bill for an act concerning mechanics' liens including the establishment of a state construction registry for residential construction property, and including effective date and applicability provisions. Effective 1-1-13.",
      "dateSigned": "2012-04-27"
    },
    {
      "billNumber": "HF 2343",
      "billTitle": "A bill for an act requiring the department of natural resources to conduct pheasant studies, contingent on outside funding, and including a repeal. Effective 7-1-12.",
      "dateSigned": "2012-04-27"
    },
    {
      "billNumber": "HF 2455",
      "billTitle": "A bill for an act relating to the examinations of the finances of certain cities and including effective date provisions. Effective 7-1-13.",
      "dateSigned": "2012-04-27"
    },
    {
      "billNumber": "HF 2458",
      "billTitle": "A bill for an act establishing a rural Iowa primary care loan repayment program and trust fund to be administered by the college student aid commission. Effective 7-1-12.",
      "dateSigned": "2012-04-27"
    },
    {
      "billNumber": "HF 2459",
      "billTitle": "A bill for an act relating to the assessment of moneys on sheep and wool production, and including effective date provisions. Effective 4-27-12.",
      "dateSigned": "2012-04-27"
    },
    {
      "billNumber": "SF 2328",
      "billTitle": "A bill for an act relating to the technical administration of the tax and related laws by the department of revenue, including the administration of income taxes, sales and use taxes, franchise fees, notification of annexation or severance by cities, and cigarette and tobacco taxes, and including retroactive applicability provisions.  (FormerlySSB 3131.) Effective 7-1-12.",
      "dateSigned": "2012-05-02"
    },
    {
      "billNumber": "SF 2332",
      "billTitle": "A bill for an act relating to enhanced 911 emergency communication systems, including surcharges and the allocation of moneys collected from such surcharges and replacing the existing surcharge on prepaid wireless service with a new surcharge collected at the point of retail sale, and including effective and applicability date provisions.  (FormerlySSB 3170andSF 2272.)  Various effective dates; see section 13 of bill.",
      "dateSigned": "2012-05-02"
    },
    {
      "billNumber": "HF 563",
      "billTitle": "A bill for an act creating the transparency in private attorney contracts Act. Effective 7-1-12.",
      "dateSigned": "2012-05-02"
    },
    {
      "billNumber": "HF 2464",
      "billTitle": "A bill for an act relating to department of public health programs and activities, providing for a penalty, and including effective and applicability date provisions. Effective 7-1-12 with exception of section 17, effective 5-2-12.",
      "dateSigned": "2012-05-02"
    },
    {
      "billNumber": "HF 2472",
      "billTitle": "A bill for an act extending the period for determining the rates of the motor fuel tax based on calculating the distribution of ethanol blended gasoline and other motor fuel, and including effective date provisions. Effective 5-2-12.",
      "dateSigned": "2012-05-02"
    },
    {
      "billNumber": "SF 430",
      "billTitle": "A bill for an act relating to violations of the open records and public meetings laws and the creation of the Iowa public information board, and including effective date provisions.  (FormerlySF 246.)  Various effective dates; see section 17 of bill.",
      "dateSigned": "2012-05-03"
    },
    {
      "billNumber": "SF 466",
      "billTitle": "A bill for an act relating to residential contractors and providing a penalty and including applicability provisions.  (FormerlySSB 1168.) Effective 7-1-12.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "SF 2237",
      "billTitle": "A bill for an act relating to social and charitable gambling concerning allowable prizes at annual game nights conducted by religious organizations and concerning the frequency of reporting and distribution of proceeds requirements for certain qualified organizations licensed to conduct social and charitable gambling.  (FormerlySSB 3017.)  Effective 7-1-12.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "SF 2283",
      "billTitle": "A bill for an act relating to various recreation and conservation activities under the purview of the department of natural resources, providing for repeals, making penalties applicable, and including effective date provisions.  (FormerlySSB 3052.)  Various effective dates; see section 21 of bill.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "SF 2284",
      "billTitle": "A bill for an act relating to programs and activities under the purview of the department of education, the state board of education, the board of educational examiners, the state board of regents, school districts, and accredited nonpublic schools, and including effective date provisions. (FormerlySSB 3171.)  Various effective dates; see sections 3 and 12 of bill.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "SF 2313",
      "billTitle": "A bill for an act relating to appropriations to certain state departments, agencies, funds, and certain other entities, providing for regulatory authority, and other properly related matters and including effective date and retroactive applicability provisions.  (FormerlySSB 3173.)  Various effective dates; see section 34 of bill.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "SF 2315",
      "billTitle": "A bill for an act relating to redesign of publicly funded mental health and disability services by requiring certain core services and addressing other services and providing for establishment of regions, revising related property tax levy provisions, and including effective date and applicability provisions.  (FormerlySSB 3152.)  Various effective dates; see sections 21, 65, 130, and 139 of bill.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "SF 2321",
      "billTitle": "A bill for an act relating to the funding of, the operation of, and appropriation of moneys to the college student aid commission, the department for the blind, the department of education, and the state board of regents, and providing effective date provisions.  (FormerlySSB 3172.) Various effective dates; see section 15 of bill.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "SF 2336",
      "billTitle": "A bill for an act relating to appropriations for health and human services and including other related provisions and appropriations, making penalties applicable, and including effective, retroactive, and applicability date provisions.  (FormerlySSB 3201.)  Item veto.  Various effective dates; see sections 51, 70, 71, and 89 of bill.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "SF 2342",
      "billTitle": "A bill for an act relating to state taxation by providing specified tax credits for the construction and installation of solar energy systems and geothermal heat pumps, modifying sales and use tax provisions related to property purchased for resale, and creating a sales tax exemption for certain items purchased for use in providing vehicle wash and wax services and including effective date and retroactive and other applicability provisions.  (FormerlySSB 3204.)  Effective 5-25-12.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "SF 2343",
      "billTitle": "A bill for an act making changes to the controlled substance schedules, applying penalties, and including effective date provisions.  Various effective dates; see section 11 of bill.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "HF 609",
      "billTitle": "A bill for an act relating to trusts and estates including the administration of small estates, and certain state inheritance tax provisions, and including applicability provisions. Effective 7-1-12.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "HF 2335",
      "billTitle": "A bill for an act relating to appropriations to the justice system, and providing effective dates. Effective 7-1-12 with exception of sections 14-17, effective 5-25-12.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "HF 2336",
      "billTitle": "A bill for an act relating to appropriations involving state government entities involved with agriculture, natural resources, and environmental protection, and including effective date provisions. Item vetoed. Effective 7-1-25 with exception of Division III, effective 5-25-12.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "HF 2337",
      "billTitle": "A bill for an act relating to appropriations to the department of cultural affairs, the economic development authority, certain board of regents institutions, the department of workforce development, the Iowa finance authority, the rebuild Iowa infrastructure fund, and the public employment relations board, eliminating the film tax credit program, providing for other properly related matters, including effective date and retroactive and other applicability provisions. Item vetoed. Effective 7-1-12 with exception of section 24 and Division IV, effective 5-25-12.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "HF 2338",
      "billTitle": "A bill for an act relating to appropriations to the judicial branch. Effective 7-1-12.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "HF 2460",
      "billTitle": "A bill for an act relating to Iowa's urban renewal law and incremental taxes by modifying provisions relating to divisions of revenue, modifying provisions relating to the approval of urban renewal plans and projects and approval of the use of certain local sales and services tax revenue, requiring certain reporting and auditing, and including applicability provisions. Effective 7-1-12.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "HF 2465",
      "billTitle": "A bill for an act relating to state and local finances by making and adjusting appropriations, providing for funding of property tax credits and reimbursements and for other matters pertaining to taxation, providing for fees and criminal penalties, providing for legal responsibilities, providing for certain insurance and employee benefits, and providing for properly related matters, and including effective date and retroactive and other applicability provisions. Item vetoed. Various effective dates, see bill.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "HF 2466",
      "billTitle": "A bill for an act relating to veterans by making appropriations to the commission of veterans affairs for the provision of veterans services and by providing certain sales tax exemptions to qualified organizations representing veterans, and including effective date and retroactive applicability provisions. Effective 5-25-12.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "HF 2470",
      "billTitle": "A bill for an act providing for sales and use taxes collected on farm machinery and equipment. Effective 7-1-12.",
      "dateSigned": "2012-05-25"
    },
    {
      "billNumber": "HF 2473",
      "billTitle": "A bill for an act relating to economic development and the use of funds by establishing programs and funds, affecting programs, tax incentives, and project completion and other assistance administered by the economic development authority, by replacing references to the economic development fund and financial assistance program, and by providing spending authority, by providing for properly related matters, and including effective date and retroactive applicability provisions. Effective 7-1-12 with exception of section 37, effective 5-25-12.",
      "dateSigned": "2012-05-25"
    }
  ]
}