{
  "year": 2011,
  "totalBills": 136,
  "bills": [
    {
      "billNumber": "HF 45",
      "billTitle": "A bill for an act relating to public funding and regulatory matters and revising appropriations and including effective and other applicability date provisions, and making penalties applicable.  Item Vetoed. Effective 3-07-11 including section 32, with exception of Divisions VII, VIII, and X, effective 7-01-11.",
      "dateSigned": "2011-03-07"
    },
    {
      "billNumber": "SF 72",
      "billTitle": "A bill for an act relating to professions which may practice together in professional limited liability companies and including effective and applicability date provisions.  (FormerlySSB 1015.) Effective 3-17-11.",
      "dateSigned": "2011-03-17"
    },
    {
      "billNumber": "SF 325",
      "billTitle": "A bill for an act relating to the boards of directors of public corporations, and including effective date provisions.  (FormerlySSB 1121.) Effective 3-23-11.",
      "dateSigned": "2011-03-23"
    },
    {
      "billNumber": "HJR 16",
      "billTitle": "A joint resolution relating to the placement of a statue in the United States capitol honoring Dr. Norman E. Borlaug. Effective 3-23-11.",
      "dateSigned": "2011-03-23"
    },
    {
      "billNumber": "SF 464",
      "billTitle": "A bill for an act allowing the establishment of an open season for hunting mourning doves.  (FormerlySF 83.)  Effective 7-1-11.",
      "dateSigned": "2011-03-24"
    },
    {
      "billNumber": "HF 267",
      "billTitle": "A bill for an act relating to the historical division of the department of cultural affairs, including the identification of historic properties by certain rural electric cooperatives and including effective date provisions. Effective 3-29-11.",
      "dateSigned": "2011-03-29"
    },
    {
      "billNumber": "SF 149",
      "billTitle": "A bill for an act allowing the department of transportation to accept reports from advanced registered nurse practitioners and physician assistants disclosing a physical or mental condition that renders a person incompetent to operate a motor vehicle.  (FormerlySSB 1036.)  Effective 7-1-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "SF 244",
      "billTitle": "A bill for an act relating to the release and satisfaction of judgments. (FormerlySSB 1042.)  Effective 7-1-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "SF 259",
      "billTitle": "A bill for an act relating to mental health and substance abuse histories conducted in a presentence investigation report and the standards for release on probation in a criminal proceeding.  (FormerlySSB 1045.) Effective 7-1-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "SF 291",
      "billTitle": "A bill for an act relating to the discovery of privileged medical records, including mental health records, in a criminal case and including effective date provisions.  (FormerlySSB 1094.) Effective 3-30-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "SF 299",
      "billTitle": "A bill for an act relating to environmental protection, including solid waste, sewage works, hazardous waste, infectious medical waste, and pesticide and fertilizer contamination.  (FormerlySSB 1046.)  Effective 7-1-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "SF 327",
      "billTitle": "A bill for an act relating to the disposition of a child with mental illness or mental retardation in juvenile court.  (FormerlySSB 1057.)  Effective 7-1-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "SF 400",
      "billTitle": "A bill for an act relating to the conveyance or encumbrance of a homestead by a spouse.  (FormerlySSB 1120.)  Effective 7-1-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "SF 402",
      "billTitle": "A bill for an act relating to the injured veterans grant program and including effective date and retroactive applicability provisions. (FormerlySSB 1134.) Effective 3-30-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "SF 429",
      "billTitle": "A bill for an act placing the agricultural development authority within the department of agriculture and land stewardship.  (FormerlySSB 1127.) Effective 7-1-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "SF 483",
      "billTitle": "A bill for an act relating to licensure by the board of educational examiners of persons who complete an administrator preparation program offered by a regionally accredited or board of educational examiners' approved non-Iowa institution.  (FormerlySF 70.) Effective 7-1-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "HF 290",
      "billTitle": "A bill for an act to allow the use of motorcycles equipped with detachable stabilizing rear wheels on Iowa roads. (FormerlyHF 53) Effective 7-01-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "HF 453",
      "billTitle": "A bill for an act relating to the regulation of egg production, and including effective date provisions. (FormerlyHSB 110) Effective 7-01-12, with exception of section 4 effective 3-30-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "HF 617",
      "billTitle": "A bill for an act relating to matters under the purview of the alcoholic beverages division of the department of commerce, including alcoholic beverage permits and licenses and administrative provisions, modifying fees, and including effective date provisions. (FormerlyHSB 187) Effective 7-01-11, with exception of section 2 effective 3-30-11.",
      "dateSigned": "2011-03-30"
    },
    {
      "billNumber": "HF 245",
      "billTitle": "A bill for an act relating to the status of posthumously conceived and born children in the context of legitimacy, inheritance, rights to claim an after-born child's share, and other rights. (FormerlyHF 63) Effective 7-01-11.",
      "dateSigned": "2011-03-31"
    },
    {
      "billNumber": "SF 124",
      "billTitle": "A bill for an act relating to the criminal offense of possessing electronic contraband or failing to report electronic contraband at a jail, municipal holding facility, or correctional facility and providing penalties. (FormerlySSB 1012.)  Effective 7-1-11.",
      "dateSigned": "2011-04-05"
    },
    {
      "billNumber": "SF 470",
      "billTitle": "A bill for an act relating to the duties and operations of the state's community colleges.  (FormerlySSB 1109.)  Effective 7-1-11.",
      "dateSigned": "2011-04-05"
    },
    {
      "billNumber": "HF 243",
      "billTitle": "A bill for an act relating to instruments used to update the county transfer books and index maintained by the county auditor.  (FormerlyHSB 43) Effective 7-01-11.",
      "dateSigned": "2011-04-05"
    },
    {
      "billNumber": "HF 271",
      "billTitle": "A bill for an act relating to criminal defendants and inmates by modifying bail restrictions placed on criminal defendants and applying credit for time served. (FormerlyHSB 63) Effective 7-01-11.",
      "dateSigned": "2011-04-05"
    },
    {
      "billNumber": "HF 348",
      "billTitle": "A bill for an act providing for voting methods which may be utilized by members of cooperative associations. Effective 7-01-11.",
      "dateSigned": "2011-04-05"
    },
    {
      "billNumber": "SF 7",
      "billTitle": "A bill for an act relating to a .08 blood alcohol limit for motorboat or sailboat operating while intoxicated offenses.  Effective 7-1-11.",
      "dateSigned": "2011-04-06"
    },
    {
      "billNumber": "SF 474",
      "billTitle": "A bill for an act relating to nonsubstantive Code corrections and including effective date and retroactive applicability provisions.  (FormerlySSB 1169.)  Various effective dates; see section 144 of bill.",
      "dateSigned": "2011-04-06"
    },
    {
      "billNumber": "HF 393",
      "billTitle": "A bill for an act allowing a physician assistant or an advanced registered nurse practitioner to sign a death certificate.  (FormerlyHSB 25) Effective 7-01-11.",
      "dateSigned": "2011-04-06"
    },
    {
      "billNumber": "HF 468",
      "billTitle": "A bill for an act relating to preferred stock issued by cooperative associations. (FormerlyHSB 99) Effective 7-01-11.",
      "dateSigned": "2011-04-06"
    },
    {
      "billNumber": "HF 562",
      "billTitle": "A bill for an act relating to the child abuse registry administered by the department of human services. (FormerlyHSB 132) Effective 7-01-11.",
      "dateSigned": "2011-04-06"
    },
    {
      "billNumber": "SF 233",
      "billTitle": "A bill for an act relating to payment for behavioral health services provided by licensed mental health counselors and certified alcohol and drug counselors under the Medicaid program.  (FormerlySF 152.)  Effective 7-1-11.",
      "dateSigned": "2011-04-07"
    },
    {
      "billNumber": "SF 240",
      "billTitle": "A bill for an act relating to matters under the purview of the alcoholic beverages division of the department of commerce, and making penalties applicable.  (FormerlySSB 1086.)  Effective 7-1-11.",
      "dateSigned": "2011-04-07"
    },
    {
      "billNumber": "SF 321",
      "billTitle": "A bill for an act relating to wastewater discharges by on-farm processing operations.  (FormerlySF 269.)  Effective 7-1-11.",
      "dateSigned": "2011-04-07"
    },
    {
      "billNumber": "SF 367",
      "billTitle": "A bill for an act concerning the protection of students from concussions and other brain injuries.  (FormerlySF 153.) Effective 7-1-11.",
      "dateSigned": "2011-04-07"
    },
    {
      "billNumber": "SF 396",
      "billTitle": "A bill for an act relating to the regulation of indemnification provisions in construction contracts.  (FormerlySSB 1172.) Effective 7-1-11.",
      "dateSigned": "2011-04-07"
    },
    {
      "billNumber": "SF 475",
      "billTitle": "A bill for an act relating to statutory corrections which may adjust language to reflect current practices, insert earlier omissions, delete redundancies and inaccuracies, delete temporary language, resolve inconsistencies and conflicts, update ongoing provisions, or remove ambiguities, and including effective date and retroactive applicability provisions.  (FormerlySSB 1177.) Various effective dates; see section 170 of bill.",
      "dateSigned": "2011-04-07"
    },
    {
      "billNumber": "SF 120",
      "billTitle": "A bill for an act relating to the grounds for which the board of educational examiners is required to disqualify an applicant for licensure or revoke a license.  (FormerlySSB 1026.)  Effective 7-1-11.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "SF 122",
      "billTitle": "A bill for an act relating to the duties of the college student aid commission and to requirements regarding certain financial aid programs administered by the commission.  (FormerlySSB 1024.) Effective 7-1-11.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "SF 123",
      "billTitle": "A bill for an act providing for immunity from civil liability for members and employees of the board of educational examiners.  (FormerlySSB 1025.) Effective 7-1-11.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "SF 205",
      "billTitle": "A bill for an act relating to matters under the purview of the department of transportation, including provisions relating to the regulation of motor vehicles and motor vehicle operations and provisions relating to the coordination of public transit funding programs, and making penalties applicable.  (FormerlySSB 1083.) Effective 7-1-11.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "SF 393",
      "billTitle": "A bill for an act relating to drainage and levee districts by providing for the delivery of a written communication to state and local government. (FormerlySSB 1124.)  Effective 7-1-11.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "SF 427",
      "billTitle": "A bill for an act relating to games of skill or chance, including allowing qualified organizations to lease certain electronic bingo equipment in order to assist disabled participants, and including effective date provisions. (FormerlySF 245.)  Various effective dates; see section 3 of bill.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "SF 512",
      "billTitle": "A bill for an act relating to public funding matters by updating the Code references to the Internal Revenue Code and by decoupling from certain federal bonus depreciation provisions, authorizing appropriation transfers, and including effective date and retroactive applicability provisions. (FormerlySSB 1201.)  Item veto.  Effective 4-12-11.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "HF 195",
      "billTitle": "A bill for an act relating to assignment of visitation or physical care parenting time for children of military service members on active duty and including effective date provisions. (FormerlyHF 66) Effective 4-12-11.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "HF 321",
      "billTitle": "A bill for an act modifying the duties of a county attorney relating to schools and to the extradition of criminal defendants and securing of certain witnesses. (FormerlyHSB 65) Effective 7-01-11.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "HF 329",
      "billTitle": "A bill for an act relating to equipment dealership agreements by providing for supplier liability. (FormerlyHSB 85) Effective 7-01-11.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "HF 364",
      "billTitle": "A bill for an act relating to veterans records managed by the department of veterans affairs. (FormerlyHSB 49) Effective 7-01-11.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "HF 532",
      "billTitle": "A bill for an act relating to agriculture, by eliminating certain powers of and requirements administered by the department of agriculture and land stewardship. (FormerlyHF 355) Effective 7-01-11.",
      "dateSigned": "2011-04-12"
    },
    {
      "billNumber": "SF 194",
      "billTitle": "A bill for an act relating to the Iowa military code and military service by making changes related to the use and support of certain facilities, operations support, employment and rank of active and retired military personnel, the definition of performing military duty, tort claims protections, and including effective date provisions.  (FormerlySSB 1047.) Various effective dates; see section 13 of bill.",
      "dateSigned": "2011-04-13"
    },
    {
      "billNumber": "SF 389",
      "billTitle": "A bill for an act relating to the nonreversion of funds appropriated to the national guard educational assistance program and including effective date and retroactive applicability provisions.  (FormerlySF 296.)  Effective 4-13-11.",
      "dateSigned": "2011-04-13"
    },
    {
      "billNumber": "SF 399",
      "billTitle": "A bill for an act regulating the advertising of veterans benefits appeal services by requiring certain disclosures and including a civil penalty. (FormerlySF 329.)  Effective 7-1-11.",
      "dateSigned": "2011-04-13"
    },
    {
      "billNumber": "HF 132",
      "billTitle": "A bill for an act relating to the filing requirements for certain ordinances relating to a division of revenue. Effective 7-01-11.",
      "dateSigned": "2011-04-13"
    },
    {
      "billNumber": "HF 299",
      "billTitle": "A bill for an act relating to the unlawful possession of or entry upon specified personal and public utility property, and providing penalties. (FormerlyHSB 51) Effective 7-01-11.",
      "dateSigned": "2011-04-13"
    },
    {
      "billNumber": "HF 389",
      "billTitle": "A bill for an act relating to investigative costs of the Medicaid fraud control unit. (FormerlyHSB 89) Effective 7-01-11.",
      "dateSigned": "2011-04-13"
    },
    {
      "billNumber": "HF 454",
      "billTitle": "A bill for an act permitting city utilities and certain cities to delegate the authority to certify unpaid rates or charges for collection by the county treasurer. (FormerlyHSB 81) Effective 7-01-11.",
      "dateSigned": "2011-04-13"
    },
    {
      "billNumber": "HF 474",
      "billTitle": "A bill for an act to designate August 7 of each year as Purple Heart Day. (FormerlyHF 374) Effective 7-01-11.",
      "dateSigned": "2011-04-13"
    },
    {
      "billNumber": "HF 512",
      "billTitle": "A bill for an act providing an exemption from standards and requirements otherwise applicable to the investment of public funds by specified state departments, agencies, and political subdivisions. (FormerlyHSB 59) Effective 7-01-11.",
      "dateSigned": "2011-04-13"
    },
    {
      "billNumber": "HF 565",
      "billTitle": "A bill for an act relating to business entities by providing for service of process for foreign corporations and the naming of professional limited liability companies, and including effective and applicability date provisions. (FormerlyHSB 166) Effective 4-13-11.",
      "dateSigned": "2011-04-13"
    },
    {
      "billNumber": "HF 593",
      "billTitle": "A bill for an act relating to the education requirements for licensed massage therapists. (FormerlyHF 304) Effective 7-01-11.",
      "dateSigned": "2011-04-13"
    },
    {
      "billNumber": "SF 286",
      "billTitle": "A bill for an act relating to the Iowa prescription monitoring program and including an effective date provision.  (FormerlySSB 1018.)  Various effective dates; see section 4 of bill.",
      "dateSigned": "2011-04-14"
    },
    {
      "billNumber": "SF 428",
      "billTitle": "A bill for an act relating to drainage districts, by providing for the assessment of benefits by state agencies, and including effective date provisions.  (FormerlySF 227.)  Effective 4-14-11.",
      "dateSigned": "2011-04-14"
    },
    {
      "billNumber": "HF 322",
      "billTitle": "A bill for an act relating to the creation of a task force concerning drug product selection relative to antiepileptic drugs for the treatment of epileptic seizures and including effective date provisions. (FormerlyHSB 23) Effective 4-14-11.",
      "dateSigned": "2011-04-14"
    },
    {
      "billNumber": "HF 390",
      "billTitle": "A bill for an act relating to an Alzheimer's disease response strategy. (FormerlyHF 60) Effective 7-01-11.",
      "dateSigned": "2011-04-14"
    },
    {
      "billNumber": "HF 404",
      "billTitle": "A bill for an act relating to payments for prepaid cemetery and funeral merchandise, and funeral services that are required to be placed in trust or secured by a surety bond. (FormerlyHF 13) Effective 7-01-11.",
      "dateSigned": "2011-04-14"
    },
    {
      "billNumber": "HF 467",
      "billTitle": "A bill for an act relating to programs and activities under the purview of the department of public health. (FormerlyHSB 90) Effective 7-01-11.",
      "dateSigned": "2011-04-14"
    },
    {
      "billNumber": "HF 516",
      "billTitle": "A bill for an act relating to the construction of subdivision improvements and certain notice requirements. (FormerlyHSB 196) Effective 7-01-11.",
      "dateSigned": "2011-04-15"
    },
    {
      "billNumber": "SF 197",
      "billTitle": "A bill for an act relating to and modifying provisions applicable to fire protection systems and electrician licensure requirements, and including effective date provisions.  (FormerlySSB 1067.) Effective 4-19-11.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "SF 260",
      "billTitle": "A bill for an act eliminating the transfer tax imposed on insurers organized in other states who elect to become domestic insurers in Iowa.  (FormerlySF 52andSF 109.)  Effective 7-1-11.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "SF 279",
      "billTitle": "A bill for an act relating to child support recovery.  (FormerlySSB 1101.) Effective 7-1-11.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "SF 312",
      "billTitle": "A bill for an act concerning registration plates issued for business-trade trucks and special trucks, and including applicability provisions. (FormerlySF 9.)  Effective 7-1-11.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "SF 315",
      "billTitle": "A bill for an act relating to emergency management planning.  (FormerlySSB 1061.)  Effective 7-1-11.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "SF 406",
      "billTitle": "A bill for an act relating to various matters under the purview of the insurance division of the department of commerce and including effective date provisions.  (FormerlySSB 1089.)  Various effective dates; see section 49 of bill.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "SF 453",
      "billTitle": "A bill for an act relating to high school graduation requirements. (FormerlySF 36.)  Effective 7-1-11.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "SF 456",
      "billTitle": "A bill for an act relating to persons prohibited from possessing or receiving firearms because of mental health commitments or adjudications and to petitions for relief from such prohibitions, and including effective date and applicability provisions.  (FormerlySSB 1183.)  Effective 4-19-11.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "SF 460",
      "billTitle": "A bill for an act relating to the licensing and regulation of real estate brokers and salespersons.  (FormerlySSB 1139.)  Effective 7-1-11.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "HF 363",
      "billTitle": "A bill for an act relating to the duties and rulemaking authority of the commission on veterans affairs. (FormerlyHF 256) Effective 7-01-11.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "HF 536",
      "billTitle": "A bill for an act concerning the duties and responsibilities of the auditor of state. (FormerlyHSB 100) Effective 7-01-11.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "HF 682",
      "billTitle": "A bill for an act providing for congressional and legislative districts and providing an effective date. (FormerlyHSB 235) Effective 4-19-11.",
      "dateSigned": "2011-04-19"
    },
    {
      "billNumber": "SF 243",
      "billTitle": "A bill for an act expanding the definition of alternate energy production facility for purposes of compliance with electric utility rate regulation requirements.  (FormerlySSB 1048.) Effective 7-1-11.",
      "dateSigned": "2011-04-20"
    },
    {
      "billNumber": "SF 326",
      "billTitle": "A bill for an act relating to the appointment of district judicial nominating commissioners, judicial officers, and senior judges.  (FormerlySSB 1010.)  Effective 7-1-11.",
      "dateSigned": "2011-04-20"
    },
    {
      "billNumber": "SF 361",
      "billTitle": "A bill for an act authorizing the Iowa state fair board to establish an endowment fund to receive gifts in trust dedicated to the maintenance and improvement of the Iowa state fairgrounds.  (FormerlySSB 1150.)  Effective 7-1-11.",
      "dateSigned": "2011-04-20"
    },
    {
      "billNumber": "SF 438",
      "billTitle": "A bill for an act relating to licensing by reciprocity for dentists. (FormerlySSB 1111.)  Effective 7-1-11.",
      "dateSigned": "2011-04-20"
    },
    {
      "billNumber": "SF 478",
      "billTitle": "A bill for an act relating to livestock by providing for their feeding and care when the livestock are deemed to be neglected.  (FormerlySSB 1180.) Effective 7-1-11.",
      "dateSigned": "2011-04-20"
    },
    {
      "billNumber": "HF 484",
      "billTitle": "A bill for an act concerning investment of certain public funds in companies doing business in Iran by the treasurer of state, public retirement systems in Iowa, and the state board of regents.  (FormerlyHSB 141) Effective 7-01-11.",
      "dateSigned": "2011-04-20"
    },
    {
      "billNumber": "HF 537",
      "billTitle": "A bill for an act relating to assisted living programs, including voluntary cessation of program operations and decertification of assisted living programs, and providing penalties. (FormerlyHSB 54) Effective 7-01-11.",
      "dateSigned": "2011-04-20"
    },
    {
      "billNumber": "HF 557",
      "billTitle": "A bill for an act relating to swine moved to and from exhibitions, and the duties of veterinarians, and including effective date provisions. (FormerlyHF 369) Effective 1-01-12.",
      "dateSigned": "2011-04-20"
    },
    {
      "billNumber": "HF 592",
      "billTitle": "A bill for an act establishing the council for agricultural education. (FormerlyHF 407) Effective 7-01-11.",
      "dateSigned": "2011-04-20"
    },
    {
      "billNumber": "SF 209",
      "billTitle": "A bill for an act relating to public funding and regulatory matters by making appropriations, providing for certain additional depreciation allowances, increasing the state earned income tax credit, and including effective date and retroactive applicability provisions.  (FormerlySSB 1052.)  Item veto.  Various effective dates; see sections 16, 18, 20, and 27 of bill.",
      "dateSigned": "2011-04-21"
    },
    {
      "billNumber": "HF 126",
      "billTitle": "A bill for an act relating to the filing of lobbyist registrations and lobbyist's client reports with the general assembly. (FormerlyHSB 14) Effective 7-01-11.",
      "dateSigned": "2011-04-26"
    },
    {
      "billNumber": "HF 405",
      "billTitle": "A bill for an act relating to records requirements applicable to state banks and state credit unions, and causes of action and duties in relation thereto. (FormerlyHF 261) Effective 7-01-11.",
      "dateSigned": "2011-04-26"
    },
    {
      "billNumber": "HF 493",
      "billTitle": "A bill for an act requiring public employees charged with a felony to pay a civil penalty equal to the cash wages received during a paid leave of absence and any contract termination payments if convicted. (FormerlyHF 139) Effective 7-01-11.",
      "dateSigned": "2011-04-26"
    },
    {
      "billNumber": "HF 658",
      "billTitle": "A bill for an act providing for the transfer of duties relating to the certification of milk from the department of public health to the department of agriculture and land stewardship, providing for the transition, and providing an appropriation. (FormerlyHF 457) (FormerlyHSB 111) Effective 7-01-11.",
      "dateSigned": "2011-04-26"
    },
    {
      "billNumber": "SF 418",
      "billTitle": "A bill for an act relating to disclosure of specified information in connection with new motor vehicle repairs.  (FormerlySSB 1098.) Effective 7-1-11.",
      "dateSigned": "2011-04-27"
    },
    {
      "billNumber": "SF 424",
      "billTitle": "A bill for an act establishing a district-to-community college program and facilities sharing pilot program.  (FormerlySF 66.) Effective 7-1-11.",
      "dateSigned": "2011-04-27"
    },
    {
      "billNumber": "SF 515",
      "billTitle": "A bill for an act relating to the administration of the streamlined sales tax agreement by the department of revenue.  (FormerlySSB 1074.)  Effective 7-1-11.",
      "dateSigned": "2011-04-27"
    },
    {
      "billNumber": "HF 254",
      "billTitle": "A bill for an act modifying provisions relating to utilization of the Iowa communications network. (FormerlyHSB 53) Effective 7-01-11.",
      "dateSigned": "2011-04-27"
    },
    {
      "billNumber": "HF 654",
      "billTitle": "A bill for an act related to drainage or levee districts, including moneys administered by the board of trustees of a drainage or levee district. (FormerlyHF 211) Effective 7-01-11.",
      "dateSigned": "2011-04-27"
    },
    {
      "billNumber": "SF 236",
      "billTitle": "A bill for an act relating to public safety including the Iowa law enforcement academy council, the state fire service and emergency response council, the state building code commissioner, fingerprint records, disposition records, the sex offender registry, and access to deferred judgment docket records.  (FormerlySSB 1072.) Effective 7-1-11.",
      "dateSigned": "2011-04-28"
    },
    {
      "billNumber": "SF 397",
      "billTitle": "A bill for an act creating a criminal offense for impersonating a decorated military veteran and providing penalties.  (FormerlySF 87.)  Effective 7-1-11.",
      "dateSigned": "2011-04-28"
    },
    {
      "billNumber": "SF 407",
      "billTitle": "A bill for an act relating to counties and other regulated entities and the permitting and enforcement powers of the department of natural resources in relation to the inspection and construction of certain sewage disposal systems and authorizing penalties.  (FormerlySF 11.)  Effective 7-1-11.",
      "dateSigned": "2011-04-28"
    },
    {
      "billNumber": "SF 482",
      "billTitle": "A bill for an act relating to requirements of the department of human services involving individuals and families and including effective date provisions.  (FormerlySSB 1182.)  Various effective dates; see sections 11 and 15 of bill.",
      "dateSigned": "2011-04-28"
    },
    {
      "billNumber": "SF 521",
      "billTitle": "A bill for an act relating to the administration of the property rehabilitation tax credit program by the department of cultural affairs and including retroactive applicability provisions.  (FormerlySSB 1204.) Effective 7-1-11.",
      "dateSigned": "2011-04-28"
    },
    {
      "billNumber": "HF 392",
      "billTitle": "A bill for an act relating to professional licensing by making changes to the Iowa plumber, mechanical professional, and contractor licensing Act and including effective date provisions.  (FormerlyHF 42) Effective 4-28-11.",
      "dateSigned": "2011-04-28"
    },
    {
      "billNumber": "HF 597",
      "billTitle": "A bill for an act creating new procedures for external review of health care coverage decisions by health carriers and including transition and applicability provisions. (FormerlyHSB 200) Effective 7-01-11.",
      "dateSigned": "2011-04-28"
    },
    {
      "billNumber": "HF 328",
      "billTitle": "A bill for an act relating to matters under the purview of the division of banking of the department of commerce, and including effective date provisions. (FormerlyHSB 79) Effective 5-03-11.",
      "dateSigned": "2011-05-03"
    },
    {
      "billNumber": "HF 461",
      "billTitle": "A bill for an act relating to the attachment of tags to deer carcasses. (FormerlyHF 96) Effective 7-01-11.",
      "dateSigned": "2011-05-03"
    },
    {
      "billNumber": "HF 679",
      "billTitle": "A bill for an act relating to the administration of the replacement tax for new cogeneration facilities, and including effective date and retroactive applicability provisions. (FormerlyHSB 105) Effective 5-03-11.",
      "dateSigned": "2011-05-03"
    },
    {
      "billNumber": "HF 652",
      "billTitle": "A bill for an act providing an exemption from the computation of the individual state income tax of all pay received for active duty military service and service in Operation New Dawn and including effective date and retroactive applicability provisions. (FormerlyHF 141) Effective 5-11-11.",
      "dateSigned": "2011-05-11"
    },
    {
      "billNumber": "SF 289",
      "billTitle": "A bill for an act relating to open records and public meetings and including effective date provisions.  (FormerlySF 25.)  Effective 5-12-11.",
      "dateSigned": "2011-05-12"
    },
    {
      "billNumber": "SF 302",
      "billTitle": "A bill for an act increasing the amount of tax credits available under the endow Iowa program and including effective date and retroactive applicability provisions.  (FormerlySF 118.) Effective 5-12-11.",
      "dateSigned": "2011-05-12"
    },
    {
      "billNumber": "SF 412",
      "billTitle": "A bill for an act relating to the powers and governance of benefited recreational lake districts, water quality districts, and combined recreational lake and water quality districts.  (FormerlySSB 1181.) Effective 7-1-11.",
      "dateSigned": "2011-05-12"
    },
    {
      "billNumber": "SF 434",
      "billTitle": "A bill for an act relating to property taxes and fees by modifying provisions relating to receipts for the payment of property taxes and provisions relating to delinquent rates and charges and by specifying certain dates for notices and delinquency.  (FormerlySSB 1178.)  Effective 7-1-11.",
      "dateSigned": "2011-05-12"
    },
    {
      "billNumber": "HF 676",
      "billTitle": "A bill for an act providing an exemption from the fee for new registration for motor vehicles leased to certain governmental agencies and nonprofit entities. (FormerlyHSB 233) Effective 7-01-11.",
      "dateSigned": "2011-05-12"
    },
    {
      "billNumber": "SF 526",
      "billTitle": "A bill for an act relating to certain forms of gambling, including horse racing, pari-mutuel wagering, and gambling games, and requiring a study of intrastate internet poker, and including effective date and retroactive applicability provisions.  (FormerlySSB 1165andSF 458.)  Various effective dates; see section 13 of bill.",
      "dateSigned": "2011-05-26"
    },
    {
      "billNumber": "SF 530",
      "billTitle": "A bill for an act relating to the family farm property tax credit by providing for eligible entities and including effective date and applicability provisions.  (FormerlySF 169.)  Effective 1-1-12.",
      "dateSigned": "2011-05-26"
    },
    {
      "billNumber": "SF 531",
      "billTitle": "A bill for an act relating to motor fuels, including biofuels and renewable fuels dispensed by retail dealers, and by providing for tax credits and refunds, providing an appropriation, and including effective date and retroactive and other applicability provisions.  (FormerlySSB 1148andSF 496.) Various effective dates; see sections 13, 22, 33, 39, 56, and 60 of bill.",
      "dateSigned": "2011-05-26"
    },
    {
      "billNumber": "HF 651",
      "billTitle": "A bill for an act providing for a special civil war sesquicentennial motor vehicle registration plate, special fallen peace officers plates, and special military combat plates, establishing fees, and making appropriations. (FormerlyHF 463) (FormerlyHF 331) Effective 7-01-11.",
      "dateSigned": "2011-05-26"
    },
    {
      "billNumber": "HF 672",
      "billTitle": "A bill for an act relating to wind and other sources of renewable energy development and production, and including effective date provisions. (FormerlyHF 634) (FormerlyHSB 201) Effective 7-01-11, with exception of section 2, effective 5-26-11.",
      "dateSigned": "2011-05-26"
    },
    {
      "billNumber": "SF 514",
      "billTitle": "A bill for an act relating to the administration of the redevelopment tax credit program for brownfields and grayfields and including retroactive applicability provisions.  (FormerlySF 178andSF 237.)  Effective 7-1-11.",
      "dateSigned": "2011-06-09"
    },
    {
      "billNumber": "HF 148",
      "billTitle": "A bill for an act relating to state expenditure requirements involving the revenue estimating conference and appropriation transfers and including effective date provisions. (FormerlyHF 1) Effective 6-30-11.",
      "dateSigned": "2011-06-30"
    },
    {
      "billNumber": "HF 698",
      "billTitle": "A bill for an act relating to and making appropriations for a period of short duration beginning July 1, 2011, providing for related matters, and including effective date and retroactive applicability provisions. (FormerlyHSB 248) Effective 7-01-11.",
      "dateSigned": "2011-06-30"
    },
    {
      "billNumber": "HF 683",
      "billTitle": "A bill for an act relating to and making transportation and other infrastructure-related appropriations to the department of transportation, including allocation and use of moneys from the road use tax fund and the primary road fund and including conditional retroactive applicability provisions. Effective 7-07-11.",
      "dateSigned": "2011-07-07"
    },
    {
      "billNumber": "SF 508",
      "billTitle": "A bill for an act appropriating federal funds made available from federal block grants and other nonstate sources, allocating portions of federal block grants, and providing procedures if federal funds are more or less than anticipated or if federal block grants are more or less than anticipated.  (FormerlySSB 1185.) Item vetoed.  Effective 7-18-11.",
      "dateSigned": "2011-07-18"
    },
    {
      "billNumber": "HF 590",
      "billTitle": "A bill for an act relating to the organization of the executive branch agencies responsible for administering economic development programs, making certain properly related changes, and including effective date and transition provisions. (FormerlyHSB 103) Effective 7-18-11.",
      "dateSigned": "2011-07-18"
    },
    {
      "billNumber": "HF 646",
      "billTitle": "A bill for an act relating to and making appropriations to certain state departments, agencies, funds, and certain other entities, providing for regulatory authority, and other properly related matters, and including effective date provisions. (FormerlyHSB 189) Item vetoed. Effective 7-18-11.",
      "dateSigned": "2011-07-18"
    },
    {
      "billNumber": "SF 509",
      "billTitle": "A bill for an act relating to and making appropriations involving state government entities involved with agriculture, natural resources, and environmental protection, and including effective date and retroactive and other applicability provisions.  (FormerlySSB 1192.)  Various effective dates; see sections 21, 26, 45, and 60 of bill.",
      "dateSigned": "2011-07-21"
    },
    {
      "billNumber": "SF 535",
      "billTitle": "A bill for an act relating to the water resources coordinating council, including by transferring associated powers and duties from the office of the governor to the department of agriculture and land stewardship. (FormerlySSB 1126andSF 500.)  Effective 7-1-11.",
      "dateSigned": "2011-07-21"
    },
    {
      "billNumber": "SF 313",
      "billTitle": "A bill for an act relating to medical assistance program-related provisions. (FormerlySSB 1100.)  Effective 7-1-11.",
      "dateSigned": "2011-07-26"
    },
    {
      "billNumber": "SF 525",
      "billTitle": "A bill for an act relating to reforming state and county responsibilities for adult disability services, making appropriations, and including effective date provisions.  (FormerlySSB 1077andSF 481.)  Various effective dates; see sections 5, 23, and 62 of bill (see alsoSF 533, section 151).",
      "dateSigned": "2011-07-26"
    },
    {
      "billNumber": "HF 649",
      "billTitle": "A bill for an act relating to and making appropriations for health and human services and including other related provisions and appropriations, and including effective, retroactive, and applicability date provisions. Item vetoed. Effective 7-26-11, with exception of Division VIII, effective 12-31-11.",
      "dateSigned": "2011-07-26"
    },
    {
      "billNumber": "SF 517",
      "billTitle": "A bill for an act relating to and making appropriations to the department of cultural affairs, the department of economic development, certain board of regents institutions, the department of workforce development, the Iowa finance authority, and the public employment relations board, and addressing related matters including tax credits and including immediate effective date and retroactive applicability provisions.  (FormerlySSB 1199.)  Item veto. Effective 7-27-11.",
      "dateSigned": "2011-07-27"
    },
    {
      "billNumber": "SF 533",
      "billTitle": "A bill for an act relating to state and local finances by providing for funding of property tax credits and reimbursements, by making and adjusting appropriations, providing for salaries and compensation of state employees, providing for matters relating to tax credits, providing for fees and penalties, providing for legal responsibilities, and providing for properly related matters, and including effective date and retroactive and other applicability provisions.  (FormerlySSB 1210.)  Item veto.  Various effective dates; see bill.",
      "dateSigned": "2011-07-27"
    },
    {
      "billNumber": "HF 645",
      "billTitle": "A bill for an act relating to the funding of, the operation of, and appropriation of moneys to the college student aid commission, the department for the blind, the department of education, and the state board of regents, and providing for related matters and for effective date, applicability provisions and retroactive applicability provisions. (FormerlyHSB 192) Item vetoed. Effective 7-27-11.",
      "dateSigned": "2011-07-27"
    },
    {
      "billNumber": "HF 648",
      "billTitle": "A bill for an act relating to and making, reducing, and transferring appropriations to state departments and agencies from the rebuild Iowa infrastructure fund, the technology reinvestment fund, the revenue bonds capitals fund, and other funds, providing for related matters and including effective date and retroactive applicability provisions. Item vetoed. Effective 7-27-11, with exception of Division V, effective 9-01-11.",
      "dateSigned": "2011-07-27"
    },
    {
      "billNumber": "SF 510",
      "billTitle": "A bill for an act relating to and making appropriations to the justice system, providing penalties, and including effective and retroactive applicability date provisions.  (FormerlySSB 1198.) Item veto.  Various effective dates; see sections 27-29 and 47 of bill.",
      "dateSigned": "2011-07-29"
    },
    {
      "billNumber": "SF 511",
      "billTitle": "A bill for an act relating to and making appropriations to the judicial branch.  (FormerlySSB 1197.)  Effective 7-29-11.",
      "dateSigned": "2011-07-29"
    }
  ]
}