{
  "year": 2014,
  "totalBills": 141,
  "bills": [
    {
      "billNumber": "HF 2130",
      "billTitle": "A bill for an act relating to matters under the purview of the banking division of the department of commerce. Effective 7-1-14.",
      "dateSigned": "2014-03-07"
    },
    {
      "billNumber": "HF 2131",
      "billTitle": "A bill for an act modifying provisions applicable to the recording of a mortgage or deed of trust executed by a transmitting utility.  Effective 7-1-14.",
      "dateSigned": "2014-03-07"
    },
    {
      "billNumber": "HF 2170",
      "billTitle": "A bill for an act relating to school instructional time. Effective 7-1-14.",
      "dateSigned": "2014-03-07"
    },
    {
      "billNumber": "HF 2172",
      "billTitle": "A bill for an act providing for the use of an electronic filing and notice system by the public employment relations board. Effective 7-1-14.",
      "dateSigned": "2014-03-07"
    },
    {
      "billNumber": "HF 2216",
      "billTitle": "A bill for an act concerning the definition of off-road utility vehicle for purposes of regulation by the department of natural resources. Effective 7-1-14.",
      "dateSigned": "2014-03-07"
    },
    {
      "billNumber": "SF 2083",
      "billTitle": "A bill for an act concerning licensure requirements for dietetics as established or approved by the academy of nutrition and dietetics. (FormerlySSB 3013.)  Effective 7-1-14.",
      "dateSigned": "2014-03-14"
    },
    {
      "billNumber": "SF 2105",
      "billTitle": "A bill for an act relating to various matters involving insurance and the insurance division of the department of commerce and including applicability provisions.  (FormerlySSB 3091.) Effective 7-1-14.",
      "dateSigned": "2014-03-14"
    },
    {
      "billNumber": "SF 2133",
      "billTitle": "A bill for an act relating to federal home loan bank rights regarding collateral pledged by insurer-members.  (FormerlySSB 3120.)  Effective 7-1-14.",
      "dateSigned": "2014-03-14"
    },
    {
      "billNumber": "SF 2193",
      "billTitle": "A bill for an act relating to the admission or retention of participants in an adult day services program.  (FormerlySSB 3055.)  Effective 7-1-14.",
      "dateSigned": "2014-03-14"
    },
    {
      "billNumber": "SF 2197",
      "billTitle": "A bill for an act relating to certain conditional permits issued by the department of natural resources relating to air and water quality. (FormerlySSB 3004.)  Effective 7-1-14.",
      "dateSigned": "2014-03-14"
    },
    {
      "billNumber": "SF 2205",
      "billTitle": "A bill for an act relating to matters under the purview of the credit union division of the department of commerce, and including effective date provisions.  (FormerlySSB 3109.)  Various effective dates; see section 7 of bill.",
      "dateSigned": "2014-03-14"
    },
    {
      "billNumber": "SF 2206",
      "billTitle": "A bill for an act concerning the Iowa finance authority in regard to the title guaranty program and private activity bonds.  (FormerlySSB 3049.) Effective 7-1-14.",
      "dateSigned": "2014-03-14"
    },
    {
      "billNumber": "SF 2230",
      "billTitle": "A bill for an act relating to education by providing technical corrections to revise references and to adjust language to reflect current state school finance practices, revising references to an accrediting agency, reestablishing a rulemaking provision relating to the beginning teacher mentoring and induction program, and providing for disposition and sale of certain school district property.  (FormerlySSB 3019.)  Effective 7-1-14.",
      "dateSigned": "2014-03-14"
    },
    {
      "billNumber": "SF 2305",
      "billTitle": "A bill for an act relating to emergency management assistance in a disaster emergency concerning mutual aid arrangements and agreements.  (FormerlySSB 3102.)  Effective 7-1-14.",
      "dateSigned": "2014-03-14"
    },
    {
      "billNumber": "HF 2067",
      "billTitle": "A bill for an act relating to the use of youth spring wild turkey hunting licenses, and including effective date provisions.  Effective 3-14-14.",
      "dateSigned": "2014-03-14"
    },
    {
      "billNumber": "HF 2297",
      "billTitle": "A bill for an act relating to the regulation of pharmacy benefits managers. Effective 7-1-14.",
      "dateSigned": "2014-03-14"
    },
    {
      "billNumber": "SF 2056",
      "billTitle": "A bill for an act relating to incentives for whole grade sharing and reorganization or dissolution by school districts.  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2104",
      "billTitle": "A bill for an act relating to the regulation of insurance company holding systems and providing assessments and penalties.  (FormerlySSB 3090.) Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2120",
      "billTitle": "A bill for an act relating to the use of professional titles or abbreviations by advanced registered nurse practitioners.  (FormerlySSB 3006.)  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2131",
      "billTitle": "A bill for an act relating to standard valuation and standard forfeiture provisions for life insurance policies or contracts and including applicability provisions.  (FormerlySSB 3089.) Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2169",
      "billTitle": "A bill for an act relating to wills including witness testimony, distribution of property, and claims of personal representatives, and including retroactive and other applicability provisions.  (FormerlySSB 3143.)  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2191",
      "billTitle": "A bill for an act relating to financing work within drainage or levee districts.  (FormerlySF 2055.)  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2192",
      "billTitle": "A bill for an act relating to the definition of motorized bicycle. (FormerlySF 2059.)  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2200",
      "billTitle": "A bill for an act relating to the Iowa business corporation Act by removing limitations imposed on shareholders making long-term arrangements affecting the affairs of the corporation, and by providing for the delivery of financial information to shareholders.  (FormerlySSB 3157.)  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2228",
      "billTitle": "A bill for an act allowing a person with a special minor's license to drive to a school for the purpose of participating in extracurricular activities conducted under a sharing agreement with the student's school of enrollment. (FormerlySSB 3148.) Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2240",
      "billTitle": "A bill for an act relating to nonsubstantive code corrections.  (FormerlySSB 3170.)  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2250",
      "billTitle": "A bill for an act relating to the licensing of vehicle recyclers.  (FormerlySSB 3018.)  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2255",
      "billTitle": "A bill for an act designating registered architects and licensed professional engineers employees of the state for specified purposes under the Iowa tort claims Act.  (FormerlySSB 1140andSF 376.)  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2276",
      "billTitle": "A bill for an act relating to adoption investigation and report requirements.  (FormerlySF 2225.)  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2290",
      "billTitle": "A bill for an act relating to identification required for operation of a railroad train.  (FormerlySF 2135.)  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2313",
      "billTitle": "A bill for an act relating to the removal of clerks of the district court. (FormerlySSB 3038.)  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2338",
      "billTitle": "A bill for an act concerning the excise tax on compressed natural gas and liquefied natural gas used as special fuel.  (FormerlySF 2101andSF 2308.) Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 381",
      "billTitle": "A bill for an act concerning horse racing, including the use of purse moneys for harness racing, advance deposit wagering, and restrictions on dosage amounts for phenylbutazone in certain horse races. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2199",
      "billTitle": "A bill for an act relating to conformity with federal law concerning the voluntary shared work program under the state unemployment insurance law and including applicability provisions.  Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2271",
      "billTitle": "A bill for an act relating to supplementary weighting for shared operational functions of school districts and area education agencies and including effective date provisions. Effective 3-26-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2288",
      "billTitle": "A bill for an act relating to reporting and other requirements concerning the department of administrative services and other state agencies. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2324",
      "billTitle": "A bill for an act relating to consumer lending transactions by modifying provisions applicable to certain loan charges and modifying designated monetary limits specified in the consumer credit code, and including applicability provisions. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2326",
      "billTitle": "A bill for an act relating to payments from the indigent defense fund by the state public defender, including effective date provisions, and providing penalties. Effective 7-1-14, with exception of section 3, effective 3-26-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2346",
      "billTitle": "A bill for an act relating to solid waste. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2365",
      "billTitle": "A bill for an act relating to employment, disciplinary, and other procedures for entities regulated by the department of inspections and appeals, and including applicability provisions. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2368",
      "billTitle": "A bill for an act modifying security freeze provisions and extending security freeze protection to specified individuals designated as protected consumers, making penalties applicable, and including effective date provisions. Effective 1-1-15.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2370",
      "billTitle": "A bill for an act relating to the supervision of orthotist or prosthetist assistants. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2378",
      "billTitle": "A bill for an act relating to the requirements for psychologist licensing. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2379",
      "billTitle": "A bill for an act relating to crisis stabilization programs authorized by the department of human services. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2389",
      "billTitle": "A bill for an act relating to misconduct under the code of professional conduct and ethics of the board of educational examiners and making penalties applicable. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2397",
      "billTitle": "A bill for an act concerning liability protection for volunteers on state lands. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2408",
      "billTitle": "A bill for an act modifying notification requirements applicable to underground facility excavations where underground facilities are present. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2421",
      "billTitle": "A bill for an act relating to transfer of guardianship in child in need of assistance proceedings. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2427",
      "billTitle": "A bill for an act relating to corn promotion, including special referendums, the assessment of a checkoff, and the creation of a task force, and making penalties applicable. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "HF 2436",
      "billTitle": "A bill for an act relating to the administration of the streamlined sales tax agreement by the department of revenue. Effective 7-1-14.",
      "dateSigned": "2014-03-26"
    },
    {
      "billNumber": "SF 2341",
      "billTitle": "A bill for an act relating to the rebate of sales tax imposed and collected at an automobile racetrack facility and including effective date and retroactive applicability provisions.  (FormerlySSB 3162.)  Effective 4-2-14.",
      "dateSigned": "2014-04-02"
    },
    {
      "billNumber": "SF 220",
      "billTitle": "A bill for an act relating to funding for retirement incentive programs offered by school districts and including effective date and retroactive applicability provisions.  (FormerlySF 66.) Effective 4-3-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2080",
      "billTitle": "A bill for an act relating to exchanging information contained in the Iowa information program for drug prescribing and dispensing.  (FormerlySSB 3007.)  Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2091",
      "billTitle": "A bill for an act relating to common forms of co-ownership of real property and including effective date and applicability provisions.  (FormerlySSB 3082.)  Effective 1-1-15.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2092",
      "billTitle": "A bill for an act relating to the criminal offense of fraudulent practice and making penalties applicable.  (FormerlySSB 3072.) Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2121",
      "billTitle": "A bill for an act making changes to the controlled substance schedules, and providing penalties.  (FormerlySSB 3008.) Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2185",
      "billTitle": "A bill for an act concerning the determination of native horses for purposes of pari-mutuel wagering.  (FormerlySSB 3151.)  Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2198",
      "billTitle": "A bill for an act providing for the issuance of a paddlefish fishing license and tag and providing penalties.  (FormerlySSB 3003.)  Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2211",
      "billTitle": "A bill for an act relating to the civil commitment of a sexually violent predator.  (FormerlySSB 3076.)  Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2212",
      "billTitle": "A bill for an act relating to land disposal of yard waste and including effective date provisions. (FormerlySF 2013.) Effective 4-3-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2257",
      "billTitle": "A bill for an act relating to programs and accounts administered by the college student aid commission.  (FormerlySSB 3045.) Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2259",
      "billTitle": "A bill for an act modifying provisions applicable to personal information security breach notification requirements, and making penalties applicable. (FormerlySSB 3040.)  Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2271",
      "billTitle": "A bill for an act relating to the duties and authority of the college student aid commission relating to the registration of certain postsecondary schools, to interstate reciprocity agreements, and to registration fees collected by the commission.  (FormerlySF 2124.)  Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2273",
      "billTitle": "A bill for an act allowing the holders of interests in certain entities eligible to hold agricultural land to be elected as trustees of drainage or levee districts.  (FormerlySSB 3172.) Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2291",
      "billTitle": "A bill for an act providing an exemption from registration fees for certain new completed motor vehicles purchased by an equipment dealer for modification and resale.  (FormerlySSB 3136.) Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2296",
      "billTitle": "A bill for an act relating to mental health treatment costs of certain persons accused of a crime.  (FormerlySF 2151.) Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2315",
      "billTitle": "A bill for an act relating to the scope and nature of use restrictions on land.  (FormerlySSB 3115.)  Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2320",
      "billTitle": "A bill for an act relating to providers of medical assistance program consumer-directed attendant care and consumer choices option services, including effective date and retroactive applicability provisions. (FormerlySF 2066.)  Effective 4-3-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2321",
      "billTitle": "A bill for an act relating to jurisdiction over certain offenses committed by members of the state military forces, and establishing certain notification and reporting requirements.  (FormerlySF 2111.)  Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "HF 514",
      "billTitle": "A bill for an act specifying procedures for resolving claims against purchased or pledged goods held by pawnbrokers. Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "HF 2132",
      "billTitle": "A bill for an act establishing the Gideon fellowship program in the office of the state public defender. Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "HF 2181",
      "billTitle": "A bill for an act relating to the maximum weight of motor vehicles covered under the lemon law and including applicability provisions.  Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "HF 2278",
      "billTitle": "A bill for an act restricting disclosures of specified information by regional transit districts, and providing a penalty. Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "HF 2325",
      "billTitle": "A bill for an act relating to certain corporations organized prior to July 1, 1971, by eliminating requirements relating to publication. Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "HF 2344",
      "billTitle": "A bill for an act relating to drainage or levee districts by providing for mergers, the liability of trustees, bidding requirements, the annexation of land, and authorizing the imposition of assessments upon affected landowners. Effective 7-1-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "HF 2435",
      "billTitle": "A bill for an act relating to taxation by updating the Code references to the Internal Revenue Code, providing for the repeal of the generation skipping transfer tax and Iowa estate tax, and including effective date and retroactive applicability provisions.  Effective 7-1-14, with exception of section 6, effective 4-3-14.",
      "dateSigned": "2014-04-03"
    },
    {
      "billNumber": "SF 2319",
      "billTitle": "A bill for an act relating to improving student literacy skills, including addressing dyslexia, and providing teacher assistance.  (FormerlySF 2070.) Effective 7-1-14.",
      "dateSigned": "2014-04-09"
    },
    {
      "billNumber": "SF 2168",
      "billTitle": "A bill for an act creating the Iowa uniform power of attorney Act and providing penalties and including applicability provisions.  (FormerlySSB 3116.)  Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "SF 2283",
      "billTitle": "A bill for an act providing a procedure for the escheatment of United States savings bonds presumed abandoned.  (FormerlySSB 3195.)  Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "SF 2328",
      "billTitle": "A bill for an act providing for the reorganization of the Code provisions relating to the Iowa finance authority, revising and eliminating programs, including the beginning farm loan program, providing for existing tax credits, providing for the powers and duties of the authority, and including effective date provisions.  (FormerlySSB 3141.)  Various effective dates; see bill.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "SF 2339",
      "billTitle": "A bill for an act relating to the administration of the redevelopment tax credits program by the economic development authority and including applicability provisions.  (FormerlySSB 3050andSF 2256.)  Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 159",
      "billTitle": "A bill for an act relating to the possession of certain products with the intent to use the products to manufacture a controlled substance, and making penalties applicable. Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 475",
      "billTitle": "A bill for an act relating to the issuance of a search warrant to authorize the placement, tracking, monitoring, and removal of a global positioning device. Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 2159",
      "billTitle": "A bill for an act relating to Miller trusts and including applicability provisions. Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 2183",
      "billTitle": "A bill for an act related to customers with delinquent accounts for the provision of wastewater, sewer system, storm water drainage system, or sewage treatment services by a city utility or city enterprise. Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 2192",
      "billTitle": "A bill for an act relating to rural water providers by making changes to water service requirements. Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 2230",
      "billTitle": "A bill for an act relating to vehicle permit requirements for equipment used primarily for construction of permanent conservation practices on agricultural land, and including effective date provisions. Effective 4-10-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 2274",
      "billTitle": "A bill for an act concerning notice of fees imposed and collected by state agencies. Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 2296",
      "billTitle": "A bill for an act relating to disposition of unclaimed property provisions applicable to gift certificates, and providing applicability provisions. Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 2387",
      "billTitle": "A bill for an act providing for notice of garnishment and levy to a judgment debtor. Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 2388",
      "billTitle": "A bill for an act relating to continuity of learning for children adjudicated under the juvenile justice law or receiving foster care services. Effective 7-1-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 2423",
      "billTitle": "A bill for an act relating to statutory corrections which may adjust language to reflect current practices, insert earlier omissions, delete redundancies and inaccuracies, delete temporary language, resolve inconsistencies and conflicts, update ongoing provisions, or remove ambiguities and providing effective and applicability dates. Effective 7-1-14, with exception of sections 88 and 153-155, effective 4-10-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "HF 2438",
      "billTitle": "A bill for an act relating to the administration of the tax and related laws of the state, including administration by the department of revenue of certain tax credits and refunds, income taxes, franchise taxes, sales and use taxes, hotel and motel taxes, and equipment taxes, and modifying provisions relating to the property assessment appeal board, and including effective date and retroactive applicability provisions. Effective 7-1-14, with exception of Divisions VI and VII, effective 4-10-14.",
      "dateSigned": "2014-04-10"
    },
    {
      "billNumber": "SF 366",
      "billTitle": "A bill for an act relating to radon control in schools.  (FormerlySF 49.) Effective 7-1-14.",
      "dateSigned": "2014-04-17"
    },
    {
      "billNumber": "SF 2312",
      "billTitle": "A bill for an act relating to the continued effect of terms, conditions, covenants, and provisions contained in documents and instruments creating or regulating multiple housing cooperatives and horizontal property regimes, by allowing limited liability companies to form multiple housing cooperatives, and including applicability provisions.  (FormerlySSB 3134.)  Effective 7-1-14.",
      "dateSigned": "2014-04-17"
    },
    {
      "billNumber": "SF 2310",
      "billTitle": "A bill for an act relating to the underage possession or consumption of alcohol and providing penalties.  (FormerlySF 2146.)  Effective 7-1-14.",
      "dateSigned": "2014-04-24"
    },
    {
      "billNumber": "SF 2311",
      "billTitle": "A bill for an act relating to the criminal offenses of enticing a minor, prostitution, sexual exploitation of a minor, and human trafficking, providing for a fee, and including effective date and applicability provisions.  (FormerlySSB 3169.)  Various effective dates; see section 16 of bill.",
      "dateSigned": "2014-04-24"
    },
    {
      "billNumber": "SF 2118",
      "billTitle": "A bill for an act relating to domestic abuse protective orders and pets or companion animals owned or held by a petitioner, respondent, or minor child of the petitioner or respondent in a domestic abuse case.  (FormerlySF 177.)  Effective 7-1-14.",
      "dateSigned": "2014-04-25"
    },
    {
      "billNumber": "SF 2195",
      "billTitle": "A bill for an act relating to matters under the purview of the utilities division of the department of commerce.  (FormerlySSB 3093.)  Effective 7-1-14.",
      "dateSigned": "2014-04-25"
    },
    {
      "billNumber": "HF 499",
      "billTitle": "A bill for an act permitting the use of crossbows to hunt deer and providing penalties. Effective 7-1-14.",
      "dateSigned": "2014-04-25"
    },
    {
      "billNumber": "HF 2366",
      "billTitle": "A bill for an act related to the policy administration of elections and voter registration and including effective date provisions.  Effective 7-1-14, with exception of Division II, effective 4-25-14.",
      "dateSigned": "2014-04-25"
    },
    {
      "billNumber": "SF 2196",
      "billTitle": "A bill for an act relating to programs and services under the purview of the department of public health, and including effective date provisions. (FormerlySSB 3014.)  Various effective dates; see section 16 of bill.",
      "dateSigned": "2014-05-02"
    },
    {
      "billNumber": "SF 2239",
      "billTitle": "A bill for an act relating to elder abuse and providing penalties. (FormerlySF 2117.)  Effective 7-1-14.",
      "dateSigned": "2014-05-02"
    },
    {
      "billNumber": "HF 2464",
      "billTitle": "A bill for an act providing for the rebate of state sales and use tax to the owner or operator of a raceway facility, and providing penalties. Effective 7-1-14.",
      "dateSigned": "2014-05-13"
    },
    {
      "billNumber": "HF 2459",
      "billTitle": "A bill for an act relating to the individual income tax by creating a tax credit for reserve peace officers and by modifying the tax credit for volunteer fire fighter and volunteer emergency medical services personnel and including retroactive applicability provisions. Effective 7-1-14.",
      "dateSigned": "2014-05-16"
    },
    {
      "billNumber": "SF 2344",
      "billTitle": "A bill for an act relating to renewable fuels, by providing for biobutanol and biobutanol blended gasoline, modifying the rate of the E-15 plus gasoline promotion tax credit and extending provisions for a biodiesel production refund, and including effective date and retroactive applicability provisions.  (FormerlySF 2333.)  Various effective dates; see section 16 of bill.",
      "dateSigned": "2014-05-21"
    },
    {
      "billNumber": "SF 383",
      "billTitle": "A bill for an act relating to the sealing of juvenile delinquency records. (FormerlySSB 1215.)  Effective 7-1-14.",
      "dateSigned": "2014-05-23"
    },
    {
      "billNumber": "HF 398",
      "billTitle": "A bill for an act relating to the duties and responsibilities of insurance producers under insurance policies or contracts.  Effective 7-1-14.",
      "dateSigned": "2014-05-23"
    },
    {
      "billNumber": "HF 2109",
      "billTitle": "A bill for an act relating to vapor products and alternative nicotine products, and providing penalties. Effective 7-1-14.",
      "dateSigned": "2014-05-23"
    },
    {
      "billNumber": "HF 2273",
      "billTitle": "A bill for an act relating to certain state and local government activities related to vehicle registration, taxation of rental vehicles, and levee and drainage districts. Effective 7-1-14.",
      "dateSigned": "2014-05-23"
    },
    {
      "billNumber": "HF 2289",
      "billTitle": "A bill for an act relating to the regulation and use of unmanned aerial vehicles. Effective 7-1-14.",
      "dateSigned": "2014-05-23"
    },
    {
      "billNumber": "HF 2454",
      "billTitle": "A bill for an act relating to the beginning farmer tax credit program, including the agricultural assets transfer tax credit and the custom farming contract tax credit, by extending the carryforward period, and including effective date and retroactive applicability provisions. Divisions I, II, and VI effective 5-23-14, Divisions III and VII effective 1-1-15, and Divisions IV and V effective 1-1-18.",
      "dateSigned": "2014-05-23"
    },
    {
      "billNumber": "HF 2468",
      "billTitle": "A bill for an act creating an individual income tax credit for qualified adoption expenses paid or incurred in connection with certain adoptions and including retroactive applicability provisions. Effective 7-1-14.",
      "dateSigned": "2014-05-23"
    },
    {
      "billNumber": "HF 2474",
      "billTitle": "A bill for an act expanding the criminal offense of and related penalties for sexual exploitation to include persons issued a school coaching authorization, and including effective date provisions. Effective 5-23-14.",
      "dateSigned": "2014-05-23"
    },
    {
      "billNumber": "HF 2476",
      "billTitle": "A bill for an act relating to funding of unified law enforcement districts, and including effective date and applicability provisions. Effective 5-23-14.",
      "dateSigned": "2014-05-23"
    },
    {
      "billNumber": "SF 303",
      "billTitle": "A bill for an act relating to veterans, military service members, and certain survivor beneficiaries and including effective date and retroactive applicability provisions.  (FormerlySSB 1158.) Various effective dates; see section 8 of bill.",
      "dateSigned": "2014-05-26"
    },
    {
      "billNumber": "SF 2352",
      "billTitle": "A bill for an act relating to the additional homestead credit for certain disabled veterans and including effective date and applicability provisions. (FormerlySSB 3219.)  Effective 5-26-14.",
      "dateSigned": "2014-05-26"
    },
    {
      "billNumber": "HF 2453",
      "billTitle": "A bill for An Act relating to the administration of the historic preservation and cultural and entertainment district tax credit program by the department of cultural affairs, providing for fees, and including applicability provisions. Effective 7-1-14.",
      "dateSigned": "2014-05-27"
    },
    {
      "billNumber": "HF 2460",
      "billTitle": "A bill for an act relating to and making appropriations to the department of cultural affairs, the economic development authority, the department of workforce development, the Iowa finance authority, the public employment relations board, and the state board of regents and regents institutions, and providing for other properly related matters, and including effective date provisions.  Item vetoed. Effective 5-27-14.",
      "dateSigned": "2014-05-27"
    },
    {
      "billNumber": "SF 2130",
      "billTitle": "A bill for an act relating to and making transportation and other infrastructure-related appropriations to the department of transportation, including allocation and use of moneys from the road use tax fund and the primary road fund, and including effective date provisions.  (FormerlySSB 3152.)  Various effective dates; see section 2 of bill.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2297",
      "billTitle": "A bill for an act relating to the criminal transmission of a contagious or infectious disease, providing penalties, and including effective date provisions.  (FormerlySSB 3196.) Effective 5-30-14.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2337",
      "billTitle": "A bill for an act relating to the child and dependent care credit available against the individual income tax, and including effective date and applicability provisions.  (FormerlySSB 3181.) Effective 1-1-15.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2340",
      "billTitle": "A bill for an act modifying provisions applicable to the solar energy system tax credit, and including effective date and retroactive applicability provisions.  (FormerlySSB 3201.) Effective 5-30-14.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2342",
      "billTitle": "A bill for an act relating to and making appropriations to certain state departments, agencies, funds, and certain other entities, providing for regulatory authority, and other properly related matters, and including effective date and retroactive applicability provisions.  (FormerlySSB 3210.)  Various effective dates; see sections 24 and 27 of bill.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2343",
      "billTitle": "A bill for an act relating to qualification requirements for the renewable energy tax credit.  (FormerlySF 2032.)  Effective 7-1-14.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2347",
      "billTitle": "A bill for an act relating to the funding of, the operation of, and appropriation of moneys to the college student aid commission, the department for the blind, the department of education, and the state board of regents, and providing for related matters.  (FormerlySSB 3213.) Effective 7-1-14.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2349",
      "billTitle": "A bill for an act relating to and making appropriations to state departments and agencies from the rebuild Iowa infrastructure fund, the technology reinvestment fund, and the revenue bonds capitals II fund, and providing for related matters, and including effective date provisions.  (FormerlySSB 3215.)  Item vetoed.  Various effective dates; see section 14 of bill.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2355",
      "billTitle": "A bill for an act relating to matters under the purview of the department of transportation, establishing a fee, and including effective date provisions. (FormerlySSB 3220.)  Various effective dates; see section 25 of bill.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2359",
      "billTitle": "A bill for an act relating to the administration of certain economic development programs by the economic development authority and including effective date and retroactive applicability provisions.  (FormerlySSB 3121,SF 2180, andSF 2354.)  Various effective dates; see bill.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2360",
      "billTitle": "A bill for an act creating the medical cannabidiol Act and providing penalties.  (FormerlySSB 3222.)  Effective 7-1-14.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2362",
      "billTitle": "A bill for an act relating to pari-mutuel racetracks, including by providing for live dog racing at pari-mutuel dog racetracks, providing for alternative licensure for dog racetracks, and establishing fees, and including effective date provisions.  (FormerlySSB 3223.)  Various effective dates; see section 13 of bill.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "SF 2364",
      "billTitle": "A bill for an act relating to state regulatory matters by exempting from sales tax the furnishing of certain environmental testing services, modifying the registration and regulation of motorsports recreational vehicles, recreational vehicle operators, and recreational vehicle cargo, and including fees, penalties, and effective date provisions.  (FormerlySSB 3225.)  Various effective dates; see section 3 of bill.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "HF 2444",
      "billTitle": "A bill for an act relating to the administration of the tax and related laws of the department of revenue, including powers and duties of the director and administration of the inheritance tax, motor fuel and special fuel taxes, and including effective date and retroactive applicability provisions. Effective 7-1-14, with exception of sections 3 and 4, effective 5-30-14.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "HF 2446",
      "billTitle": "A bill for an act exempting from the sales tax the sales price of a diesel fuel trailer or seed tender used primarily in agricultural production. Effective 7-1-14.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "HF 2448",
      "billTitle": "A bill for an act relating to the administration of programs by the economic development authority by modifying the high quality jobs program, creating a workforce housing tax incentives program and making penalties applicable, and repealing the enterprise zone program, and including effective date and retroactive and other applicability provisions. Effective 7-1-14, with exception of Division II and section 27, effective 5-30-14.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "HF 2449",
      "billTitle": "A bill for an act relating to appropriations to the judicial branch. Effective 7-1-14.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "HF 2450",
      "billTitle": "A bill for an act relating to appropriations to the justice system and including effective date provisions. Item vetoed. Effective 7-1-14, with exception of Division I and section 19, effective 5-30-14, and section 18, effective 1-1-15.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "HF 2458",
      "billTitle": "A bill for an act relating to and making appropriations involving state government entities involved with agriculture, natural resources, and environmental protection, providing for taxable property, making related statutory changes, and including effective date and retroactive applicability provisions. Item vetoed.  Effective 7-1-14, with exception of Divisions VIII, X, XI, and XII, effective 5-30-14.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "HF 2463",
      "billTitle": "A bill for an act relating to appropriations for health and human services and veterans and including other related provisions and appropriations, extending the duration of county mental health and disabilities services fund per capita levy provisions, and including effective date and retroactive applicability provisions.  Item vetoed. Various effective dates, see bill.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "HF 2466",
      "billTitle": "A bill for an act relating to the assessment of certain housing rented or leased to low-income individuals and families and including applicability provisions. Effective 7-1-14.",
      "dateSigned": "2014-05-30"
    },
    {
      "billNumber": "HF 2473",
      "billTitle": "A bill for an act relating to state and local finances by making appropriations, providing for fees, providing for legal responsibilities, and providing for regulatory requirements, taxation, and other properly related matters, and including penalties and effective date and retroactive applicability provisions. Item vetoed. Various effective dates, see bill.",
      "dateSigned": "2014-05-30"
    }
  ]
}